{
  "index": 543,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the generated code is executable for demonstration purposes. Design a market research report management system where market researchers can upload research report files (PDF, PPT formats) and add research location and time to the reports. Market department managers (username: marketmgr, password: marketpass) can log into the system, view all research reports, filter by location or time, and share reports with other departments.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the file upload and report metadata management system fully implemented?",
      "description": "Review whether the code includes a complete file upload mechanism that supports PDF and PPT formats, along with metadata collection for research location and time. Score 0 if file upload functionality is missing, 5 if basic upload exists but without proper validation or metadata handling, and 10 if the implementation includes file type validation, size limits, progress indicators, and proper metadata association.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the authentication and authorization system properly implemented?",
      "description": "Check if the system implements secure authentication for the market manager (username: marketmgr, password: marketpass) with appropriate session management and CSRF protection. Evaluate if role-based access control is implemented to differentiate between researchers and managers. Deduct 5 points if passwords are stored in plaintext, 3 points if session management is insecure, and 3 points if there's no protection against brute force attacks. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are the report filtering and search capabilities implemented effectively?",
      "description": "Evaluate the filtering system by location and time, looking for features like multi-criteria search, date range selection, and geographic hierarchies. Score 0 if filtering is absent, 5 if only basic filtering is available without advanced options, and 10 if the implementation includes real-time filtering with efficient database queries, advanced filter combinations, and search history functionality.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the report sharing mechanism secure and functional?",
      "description": "Assess whether the sharing functionality allows managers to share reports with other departments selectively, with options for setting permissions or expiration dates. Check if the system generates secure sharing links or implements department-level permissions. Deduct 5 points if sharing lacks access controls, 3 points if no audit trail exists for shared reports, and 3 points if there's no way to revoke access. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as failed uploads, invalid file formats, network interruptions, database connection issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Automatic report summarization 2. Visual analytics dashboard for research trends 3. Integration with notification systems for new reports). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple file upload mechanisms coexisting) 2. Function modules unrelated to market research management (e.g., a built-in social media feed) 3. Fancy effects that affect performance (e.g., excessive animations in the dashboard). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/service/controller layers), unit test coverage, and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Management Systems-File Management",
  "difficulty": "hard"
}