{
  "index": 1448,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate, professional responses. Be sure to provide executable code where possible. Design a webpage for \"Let's Farm\" variety show in HTML format using PyCharm.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the basic structure of the 'Let's Farm' variety show webpage implemented correctly?",
      "description": "Check if the HTML structure includes DOCTYPE declaration, head with appropriate meta tags, title, and a well-structured body with semantic HTML5 elements (header, main, footer, etc.). Score 0 if only basic tags are present without semantic structure, 5 if basic semantic structure is implemented but lacks organization, and 10 if a complete, well-organized semantic HTML structure is implemented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the visual design suitable for a farming variety show theme?",
      "description": "Evaluate whether the webpage incorporates appropriate farming-related visual elements (images, color schemes with greens/earthy tones, nature-inspired design elements). Deduct 5 points if the theme is barely recognizable as farm-related, 3 points if the theme is present but inconsistently applied. Give 10 points for a cohesive, immersive farming theme that effectively represents the show.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is responsive design implemented for multiple device compatibility?",
      "description": "Check if the code includes viewport meta tag, media queries, flexible grid layouts, and responsive images. Score 0 if the page is fixed-width only, 5 if basic responsiveness is implemented but breaks at certain viewports, and 10 if the page is fully responsive across all common device sizes with appropriate content adaptation.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are show-specific features implemented and functional?",
      "description": "Review implementation of variety show essential elements: episode listing, cast profiles, show schedule, highlight clips or galleries, and interactive elements (voting systems, comments). Deduct 2 points for each missing core feature. The webpage should clearly communicate the show's concept and engage the target audience. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code handles potential issues (broken image links, form validation, accessibility considerations) and provides fallbacks. Code with strong robustness should validate user inputs, include alt text for images, and have error handling for external resources. Give 10 points for comprehensive error handling, 5 points for basic protection, and 0 points if no error handling exists.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive farm map 2. Season-based theme switching 3. Animated farm elements 4. Virtual crop growing simulation). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Duplicate content sections 2. Feature modules unrelated to the farming show theme 3. Excessive decorative elements that harm usability or performance (e.g., too many animations, unnecessarily heavy background videos). Deduct 3 points for each redundancy found, and directly deduct 10 points if core content is obscured by redundant elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review code organization (separate CSS/JS files or properly organized internal sections), naming conventions, comments, and optimization for performance. Deduct 5 points if styles and scripts are scattered throughout the HTML; deduct 5 points if code is poorly formatted or inconsistently named; deduct 5 points if no performance optimizations are implemented (image optimization, resource loading strategy). The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "easy"
}