{
  "index": 1812,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate, professional responses. Be sure to provide executable code when possible. Help me create a mobile wallpaper webpage.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core wallpaper display and browsing functionality implemented?",
      "description": "Review whether the code properly implements a responsive grid/layout for displaying wallpapers and includes navigation controls for browsing through the collection. Score 0 if no display mechanism exists, 5 if basic display is implemented but lacks organization, and 10 if it includes proper thumbnails, categories, and smooth navigation.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are wallpaper preview and download functions properly implemented?",
      "description": "Check if the code includes functionality for users to preview wallpapers in full-screen mode before downloading, and whether it implements proper download functionality with appropriate file formats (JPG/PNG) and resolution options for different mobile devices. Deduct 5 points if preview is missing, and 3 points if download options are limited. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is mobile responsiveness properly implemented?",
      "description": "Evaluate whether the webpage is fully responsive across different mobile device sizes (from small phones to tablets), with appropriate media queries, flexible grid layouts, and touch-friendly UI elements. Deduct 5 points if the layout breaks on specific screen sizes and 5 points if touch interactions are poorly implemented. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are wallpaper filtering and search features implemented?",
      "description": "Check if the code includes functionality for users to filter wallpapers by categories, colors, resolution, or tags, and whether there's a search feature with proper indexing. Deduct 3 points if filtering is limited, 3 points if search doesn't support partial matching, and 4 points if there's no visual feedback during search/filter operations. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as image loading failures, network interruption, unsupported device orientations, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Live wallpaper support with subtle animations 2. Dark/light mode toggle that affects UI and wallpaper suggestions 3. Wallpaper cropping/customization tools). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple image loading libraries) 2. Function modules unrelated to wallpapers (e.g., a built-in calculator) 3. Fancy effects that affect performance (e.g., unnecessary parallax effects). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating UI components/services/state management), asset optimization (image compression, lazy loading), and performance optimization. Deduct 5 points if global state pollution is found; deduct 5 points if unoptimized images cause slow loading; deduct 5 points if there's no code organization or bundling strategy. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern mobile design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (touch targets at least 44x44px, consistent margins) 3) Professional typography (readable fonts, proper contrast ratios). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for elements that extend beyond screen boundaries. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to mobile interaction standards: 1) Touch feedback delay ≤ 100ms 2) Smooth scrolling without jank 3) Appropriate loading indicators for network operations. Deduct 5 points for each operation without feedback, 3 points for choppy animations, and 5 points for interactions that don't follow platform conventions (iOS/Android). The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "easy"
}