{
  "index": 1824,
  "question": "You are a coding expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable for display. Generate webpage code showing a dancing dog.",
  "checklist": [
    {
      "id": 0,
      "title": "Is a basic HTML/CSS/JavaScript structure implemented for the dancing dog animation?",
      "description": "Review whether the code has a proper HTML structure with necessary CSS styling and JavaScript functionality to create a foundation for the dancing dog animation. Score 0 if the basic structure is missing, 5 if only partial implementation exists, and 10 if a complete and organized structure is provided.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the dancing dog animation properly implemented?",
      "description": "Evaluate the animation technique used (CSS animations, JavaScript animations, SVG animations, or canvas). Check if the dance movements are smooth, natural, and looping properly. Score 3 for basic movement, 7 for moderate animation with 2-3 dance moves, and 10 for complex, natural-looking dance sequences with multiple movements.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the dog character visually appealing and well-designed?",
      "description": "Judge whether the dog character is visually appealing. This can be through SVG graphics, CSS art, image sprites, or 3D models. Check for proper articulation points for animation, character proportion, and aesthetic appeal. Deduct 5 points if the dog is too simplistic (stick figure), 3 points if proportions are awkward, and 2 points if the design lacks charm or personality.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are interactive elements included to enhance the dancing experience?",
      "description": "Check if the implementation includes user interaction capabilities like clicking to change dance moves, speed controls, music toggle, or customization options. Score 0 if no interaction exists, 5 if basic interaction is implemented, and 10 if multiple engaging interactive elements are present.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser compatibility issues, screen size variations, script errors, etc.) and provide graceful degradation. Code with strong robustness should include error handling, responsive design principles, and browser compatibility checks, giving 10 points. If the robustness is average, give 5 points, and if no error handling or adaptability is implemented, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Sound effects synchronized with dance moves 2. Environmental interactions like the dog responding to cursor movement 3. Customizable dog appearance). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant animation definitions (e.g., multiple animation frameworks doing the same job) 2. Function modules unrelated to the dancing dog (e.g., unrelated UI elements) 3. Excessive effects that affect performance (e.g., too many particles or complex shadows). Deduct 3 points for each redundancy found, and directly deduct 10 points if core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating animation logic/view/control layers), code organization, and maintainability. Deduct 5 points if global state pollution is found or if animation and business logic are mixed; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the code lacks comments or documentation. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional visual hierarchy (clear distinction between the dancing dog and background elements). Deduct 3 points for cluttered design elements, 5 points for jarring color combinations, and 5 points for poor visual focus on the dancing dog. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the animation performance optimized?",
      "description": "Judge whether the animation runs smoothly without causing browser lag: 1) Uses requestAnimationFrame or CSS animations over setTimeout 2) Implements GPU acceleration where appropriate 3) Optimizes repaints and reflows. Deduct 5 points for noticeable frame drops during animation, 3 points for lack of performance optimization techniques, and 5 points if the animation causes significant browser strain on average devices. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "easy"
}