{
  "index": 242,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration purposes. Help me draw a black hole from the movie \"Interstellar\" using HTML code. It should be a single file and match the appearance of the black hole as seen in the movie.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core visual representation of the black hole implemented accurately?",
      "description": "Evaluate whether the code successfully creates a realistic visual representation of the black hole from 'Interstellar', including the accretion disk, event horizon, and gravitational lensing effects. Score 0 if the core elements are missing, 5 if basic elements are present but lack detail, and 10 if the visualization closely resembles Gargantua from the movie.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the key visual components of Gargantua properly implemented?",
      "description": "Check if the code includes the specific visual characteristics of the 'Interstellar' black hole: the thin, bright accretion disk with its asymmetric brightness (brighter on the approaching side due to relativistic beaming), the dark event horizon in the center, and the distinctive halo effect. Deduct 3 points for each missing element. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the gravitational lensing effect properly simulated?",
      "description": "Assess whether the code implements the critical gravitational lensing effect that creates the distinctive appearance of light bending around the black hole. This should include the visualization of how the accretion disk appears both above and below the black hole due to extreme light bending. Score 0 if no lensing is implemented, 5 if basic warping is present, and 10 if the effect accurately mimics the movie's physics-based representation.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the simulation interactive or animated to enhance the visual experience?",
      "description": "Evaluate whether the code includes animation or interactive elements that enhance the black hole visualization, such as disk rotation, perspective changes, or user controls. Score 0 if static only, 5 if basic animation is implemented, and 10 if comprehensive interactive elements are included that allow viewers to experience the black hole from different perspectives.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle different viewport sizes, browser compatibility issues, and potential rendering challenges. Code should degrade gracefully if certain features are not supported. Full implementation with fallbacks and responsive design earns 10 points, average implementation with some responsiveness earns 5 points, and implementations that break on different devices earn 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Time dilation visualization effects 2. Sound elements reminiscent of Hans Zimmer's score 3. Interactive educational elements explaining black hole physics). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant rendering methods that accomplish the same visual effect 2. Unnecessary elements unrelated to the black hole visualization 3. Excessive effects that impact performance without enhancing the core representation. Deduct 3 points for each redundancy found, and directly deduct 10 points if redundant code interferes with the core visualization.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review the structure of the HTML/CSS/JS implementation, looking for clean separation of concerns, efficient rendering techniques, and appropriate use of canvas/WebGL/SVG based on the visualization needs. Deduct 5 points if global scope pollution is found; deduct 5 points if there is significant code duplication; deduct 5 points if the implementation uses inappropriate technologies for the task. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the visual presentation meet professional design standards?",
      "description": "Evaluate whether the black hole visualization follows cinematic design principles: 1) Appropriate color gradient for the accretion disk (orange/red/blue spectrum as in the film) 2) Proper contrast ratio between the event horizon and surrounding elements 3) Clean implementation without visual artifacts or pixelation. Deduct 3 points for each inaccuracy in color representation, 5 points for poor contrast that makes elements difficult to distinguish, and 5 points for visible rendering artifacts. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the visual experience smooth and immersive?",
      "description": "Judge whether the rendering maintains consistent frame rates (minimum 30fps) during animations, transitions occur smoothly, and the overall experience creates the sense of cosmic scale and awe that the film conveyed. Deduct 5 points for stuttering animations, 3 points for jarring transitions, and 5 points if the scale and proportions fail to create immersion. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "medium"
}