{
  "index": 380,
  "question": "You are a code expert, please use your professional knowledge to generate accurate and professional responses. Make sure to ensure the generated code is executable for display. Please create a webpage about \"Nezha: The Sea Dragon\" in anime style.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the Nezha character accurately represented in anime style?",
      "description": "Review if the code creates a visual representation of Nezha that authentically reflects anime aesthetics (big eyes, distinctive hairstyle, exaggerated expressions) and incorporates his mythological elements (fire wheels, red ribbon, cosmic ring, fire-tipped spear). Score 0 if Nezha is absent, 5 if basic representation exists but lacks anime style details, and 10 if the character is fully realized with anime style elements and mythological accuracy.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the \"Sea Dragon\" theme integrated effectively?",
      "description": "Evaluate whether the code implements visual elements representing the sea dragon antagonist and the water/ocean environment. Check for animations or illustrations showing the conflict between Nezha and the dragon. Deduct 5 points if the sea dragon is completely missing, 3 points if water elements are minimal, and give full marks if both the dragon and dynamic water elements are implemented creatively. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are interactive anime-style animations implemented?",
      "description": "Check for CSS/JavaScript animations that reflect anime visual language (speed lines, impact frames, particle effects, smooth transitions). Score 0 if no animations exist, 5 if only basic transitions are present, and 10 if the page includes multiple anime-style animations that enhance the storytelling (e.g., Nezha's fire wheel spinning, water splash effects, dragon movements). Deduct 3 points if animations are jerky or cause performance issues.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is responsive design properly implemented for the anime webpage?",
      "description": "Test if the webpage maintains its anime aesthetic across different screen sizes (desktop, tablet, mobile). Check if media queries adjust layout, font sizes, and image scaling appropriately. Deduct 5 points if the page breaks on mobile, 3 points if some elements overflow or become misaligned, and give 10 points if the responsive design preserves the anime style experience across all common device sizes.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (image loading failures, browser compatibility issues, user interaction errors) and provide fallback mechanisms. Code with strong robustness should gracefully handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the anime experience (e.g., 1. Interactive character poses that change on click 2. Dynamic weather/water effects 3. Voice clips or sound effects on interaction). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar effects (e.g., multiple parallax libraries) 2. Function modules unrelated to Nezha or anime (e.g., unnecessary form elements) 3. Fancy effects that affect performance (e.g., excessive particle systems that cause lag). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core anime presentation is interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of HTML structure, CSS styling, and JavaScript interaction), code readability, and maintainability. Deduct 5 points if global CSS/JS conflicts are found; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if best practices for web development are not followed. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional anime design standards?",
      "description": "Evaluate whether the design follows anime aesthetic principles: 1) Vibrant color palette typical of anime 2) Character designs with proper proportions and style 3) Typography that complements the anime theme (possibly including some Japanese-inspired fonts). Deduct 3 points for each visually inconsistent element, 5 points for color combinations that don't match anime aesthetics, and 5 points for non-complementary typography. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the interactive elements follow anime conventions: 1) Smooth transitions between states 2) Appropriately timed animations (300-800ms for character movements) 3) Clear visual feedback for user interactions. Deduct 5 points for each operation without feedback, 3 points for choppy animations, and 5 points for confusing navigation or interaction patterns. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "easy"
}