{
  "index": 1344,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure the generated code is executable for display. You are a skilled web designer - please help me design a webpage that shows a white cat playing ping pong, using HTML language.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core ping pong animation implemented?",
      "description": "Review whether the code creates a functional animation of a white cat playing ping pong. Check for proper motion paths of the ball, realistic paddle movement, and cat character reactions. Score 0 if there's no animation, 5 if only basic static positioning exists, and 10 if there's a complete animation loop with proper physics.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the white cat character properly designed and animated?",
      "description": "Evaluate whether the cat is clearly identifiable as white, has proper proportions, and demonstrates appropriate movements for ping pong (like swinging motions, reaction poses). Deduct 3 points if the cat lacks defining features, 5 points if it's not clearly white, and 5 points if it has no animation or interaction with the ping pong elements. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the ping pong game environment properly visualized?",
      "description": "Check whether the code creates a convincing ping pong setting with appropriate elements (table, net, paddle, ball) with correct proportions and positioning. Deduct 3 points for each missing essential element, 5 points if the spatial relationship between elements is incorrect. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the implementation technically appropriate?",
      "description": "Assess whether the code uses appropriate HTML/CSS/JS techniques for the animation. Check for modern approaches like CSS animations, canvas, SVG, or proper JavaScript animation frameworks instead of outdated methods. Deduct 5 points for deprecated techniques (like <marquee>), 3 points for excessive use of images where vector graphics would be more appropriate. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser resizing, different screen sizes, script errors) and provides graceful fallbacks. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. User-controlled cat movements 2. Sound effects for ping pong hits 3. Score tracking system 4. Day/night mode toggle). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple animation controls) 2. Function modules unrelated to the cat playing ping pong 3. Fancy effects that affect performance (e.g., unnecessary complex animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating animation logic/view layers), code organization, and maintainability. Deduct 5 points if global style/script pollution is found; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there are no comments for complex logic. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing 3) Professional typography (if text is included). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for poor composition that makes the scene unclear. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and responsive?",
      "description": "Judge whether the animations conform to human perception characteristics: 1) Smooth motion without stuttering 2) Appropriate animation timing (not too slow or fast) 3) Natural physics in ball movement and bouncing. Deduct 5 points for jerky animations, 3 points for unrealistic physics, and 5 points for animations that run at inappropriate speeds making the ping pong game look unnatural. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Web Visuals",
  "difficulty": "easy"
}