{
  "index": 1559,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure that the code you generate is executable for demonstration purposes. I am a high school physics teacher preparing to teach the law of conservation of momentum. Could you create a series of clear and accurate demonstration animations and organize them into a simple HTML presentation?",
  "checklist": [
    {
      "id": 0,
      "title": "Are the physics principles accurately implemented?",
      "description": "Review whether the code correctly implements the law of conservation of momentum with accurate mathematical formulas (p = mv, Σp_before = Σp_after). Check if collision calculations properly handle elastic/inelastic collisions, mass conservation, and velocity calculations. Score 0 if physics formulas are incorrect, 5 if basic momentum is shown but calculations are imprecise, and 10 if all momentum conservation scenarios are accurately modeled with correct physics equations.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are comprehensive demonstration scenarios provided?",
      "description": "Evaluate whether the animations cover essential momentum conservation scenarios: 1) Two objects colliding (elastic collision) 2) Inelastic collision with objects sticking together 3) Explosion/separation scenarios 4) Different mass ratios demonstrations. Each scenario should be visually distinct and educationally valuable. Deduct 3 points for each missing core scenario. Full score requires at least 4 different momentum conservation demonstrations.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are the animations educationally effective and scientifically clear?",
      "description": "Check if animations include real-time display of momentum values, velocity vectors, and mass indicators. Evaluate whether the animation speed allows students to observe and understand the physics process (2-5 seconds per collision cycle). Animations should show before/after momentum calculations clearly. Deduct 5 points if momentum values are not displayed, 3 points if animations are too fast to follow, and 5 points if vector representations are missing.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the HTML presentation structure well-organized for teaching?",
      "description": "Review whether the presentation includes: 1) Clear navigation between different scenarios 2) Step-by-step progression from simple to complex examples 3) Interactive controls (play/pause/reset) 4) Educational annotations explaining each demonstration. Check if the presentation flow follows pedagogical best practices. Deduct 5 points if navigation is confusing, 3 points if interactive controls are missing, and 5 points if educational context is insufficient.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as division by zero in momentum calculations, extreme velocity values, browser compatibility issues, animation frame drops, etc.) and provide stable performance across different devices. Code with strong robustness should effectively handle edge cases and maintain smooth animations. Give 10 points if fully robust, 5 points if average robustness, and 0 points if no exception handling.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative educational features that enhance learning?",
      "description": "Check whether the code includes educational enhancements such as: 1) Interactive parameter adjustment (mass/velocity sliders) 2) Real-time momentum vector visualization 3) Slow-motion replay functionality 4) Comparative analysis tools 5) Quiz/assessment integration. Add 2-3 points for each practical educational feature implemented (maximum 10 points). Features must genuinely enhance physics understanding.",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1) Redundant animation implementations or duplicate physics calculations 2) Features unrelated to momentum conservation (e.g., sound effects, decorative elements that distract from learning) 3) Over-complicated visual effects that obscure the physics principles. Deduct 3 points for each redundancy found, and directly deduct 10 points if educational clarity is compromised by unnecessary features.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separating physics calculations, animation rendering, and UI controls), code organization, and maintainability. Check for proper variable naming, function separation, and code reusability. Deduct 5 points if physics calculations are mixed with rendering code; deduct 5 points if code duplication rate exceeds 30%; deduct 5 points if global variables are overused. Full score requires clean, modular, and maintainable code structure.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface design meet educational presentation standards?",
      "description": "Evaluate whether the design follows educational material principles: 1) High contrast for classroom projection (dark text on light background) 2) Clear, readable fonts (minimum 16px for body text) 3) Logical layout with proper spacing 4) Color coding that aids understanding (e.g., different colors for different objects). Deduct 3 points for each hard-to-read element, 5 points for poor color contrast, and 5 points for cluttered layout that impedes learning.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Are the animations smooth and pedagogically appropriate?",
      "description": "Judge whether animations are optimized for educational use: 1) Consistent frame rate (minimum 30fps) 2) Appropriate animation speed for observation and learning 3) Clear visual feedback for user interactions 4) Smooth transitions between different scenarios. Deduct 5 points for choppy animations, 3 points for inappropriate speed that hinders comprehension, and 5 points for poor transition effects. Animations should enhance rather than distract from physics understanding.",
      "maxScore": 10
    }
  ],
  "class": "Simulation & Modeling-Physics Simulation",
  "difficulty": "medium"
}