{
  "index": 349,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. 5th Grade Science Semester 2 Knowledge Outline\n\n## Unit 1: Heart and Brain\n### Lesson 1: Our Brain\n1. The brain is the \"command center\" of the human body, directing human actions, generating thoughts and emotions, and performing cognition and decision-making. The brain controls human behavior and emotions.\n2. The brain is divided into three parts: the cerebrum, cerebellum, and brainstem. The cerebrum is divided into left and right hemispheres. Different regions have different functions.\n3. Our brain has sensory centers, auditory centers, motor centers, and visual centers.\n4. We can think, judge, and experience emotions like happiness, anger, sadness, and joy. This is the brain at work.\n\n### Lesson 2: The Nervous System\n1. The nervous system includes the brain, peripheral nerves, and spinal cord.\n2. Nerves are the body's \"telephone lines,\" capable of promptly reporting information obtained from various parts of the body to the brain, and transmitting commands from the brain to various parts of the body.\n3. After the starting gun fires, an athlete's ears receive the sound stimulus, the auditory nerve transmits the signal to the brain, the brain determines it's the starting signal, sends commands through nerves to the muscles, and the athlete begins to run.\n4. If a finger is suddenly pricked by a sharp object, we withdraw our hand first, then feel the pain.\n\n### Lesson 3: Protecting the Brain\n1. The brain is a vital organ of the human body.\n2. How does the human body protect the brain?\n   Answer: ①The skull, similar to a walnut shell, protects the brain. ②There are membranes between the skull and brain tissue that protect and support brain tissue. ③Yawning is a brief self-protective method for the brain to increase blood oxygen levels.\n3. How can we protect our brain?\n   Answer: ①Adequate sleep; ②Alternating between different subjects when studying; ③Appropriate physical exercise; ④No smoking or excessive drinking; ⑤Wearing helmets when cycling.\n\n### Lesson 4: Heart and Blood Vessels\n1. Heart rates differ by age. For children and adolescents under normal circumstances, the heart beats 60 to 100 times per minute.\n2. Heart rate is the number of heartbeats per minute. Pulse rate is the number of arterial pulsations per minute. Under normal circumstances, a person's pulse rate and heart rate are the same.\n3. The heart is located on the left side of the chest cavity, shaped like an inverted pear, larger at the top and smaller at the bottom, approximately the size of one's fist. The heart has four chambers: left atrium, right atrium, left ventricle, and right ventricle.\n4. Blood vessels are divided into arteries, veins, and capillaries.\n5. Each time the heart contracts and relaxes, we feel one heartbeat. Typically, the heart pumps about 70ml of blood with each beat.\n6. How to protect our heart and blood vessels?\n   Answer: ①Daily outdoor exercise; ②Calm emotions and positive outlook; ③Balanced diet and moderate eating habits.\n\n### Lesson 5: Our Health Records\n1. Establishing health records helps us understand our physical health status and prevent and treat diseases in a timely manner.\n2. The WHO has outlined indicators of human health:\n   (1) Mental vitality, able to cope with daily life and work calmly.\n   (2) Positive attitude, optimistic outlook, willingness to take responsibility, non-critical.\n   (3) Ability to rest well, good sleep quality.\n   (4) Strong adaptability, able to adjust to various environmental changes.\n   (5) Certain resistance to common colds and infectious diseases.\n   (6) Appropriate weight, proportionate physique.\n   (7) Bright eyes, quick reactions, no eyelid inflammation.\n   (8) Clean, undamaged teeth, gums that don't bleed.\n   (9) Lustrous hair without dandruff.\n   (10) Radiant and elastic skin, walking with ease and vitality.\n\nPlease generate a game code with 40 challenge questions based on this content. The game code should be able to run offline. The game background should be light blue.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the educational content accurately implemented based on the 5th Grade Science curriculum?",
      "description": "Review whether the 40 challenge questions accurately cover all five lessons from Unit 1: Heart and Brain. Check if questions properly test knowledge about brain structure (cerebrum, cerebellum, brainstem), nervous system components, brain protection methods, heart anatomy (four chambers), blood vessels (arteries, veins, capillaries), and health indicators. Score 0 if less than 30 questions are implemented, 5 if questions cover only 3-4 lessons comprehensively, and 10 if all curriculum points are accurately represented with appropriate difficulty levels.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the game mechanics and challenge system properly designed?",
      "description": "Evaluate whether the game includes proper question randomization, scoring system, progress tracking, and multiple question types (multiple choice, true/false, fill-in-the-blank, drag-and-drop). Check for proper game flow with clear instructions, question feedback, and completion rewards. Deduct 5 points if no scoring system exists, 3 points if questions appear in fixed order without randomization, and 5 points if feedback mechanisms are missing. Full score requires engaging educational gameplay mechanics.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the offline functionality completely implemented?",
      "description": "Verify that the game runs entirely offline without requiring internet connectivity. All assets (images, sounds, data) must be embedded or locally stored. Check that the game loads and functions properly when disconnected from the network. The application should be self-contained with no external API calls or CDN dependencies. Deduct 10 points if any network requests are required, 5 points if assets fail to load offline, and 3 points if performance degrades significantly in offline mode.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the educational progression and learning reinforcement well-structured?",
      "description": "Assess whether the game provides proper learning scaffolding with questions organized by difficulty and topic progression. Check for hint systems, explanation of correct answers, and knowledge reinforcement through varied question formats. Evaluate if the game tracks learning progress and provides remedial questions for incorrect answers. Deduct 5 points if no difficulty progression exists, 3 points if explanations are missing for wrong answers, and 5 points if no learning analytics or progress tracking is implemented.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid user inputs, missing data, browser compatibility issues, and unexpected user behaviors) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative educational features that enhance learning?",
      "description": "Check whether the code includes engaging features that improve educational outcomes (e.g., 1. Interactive anatomical diagrams 2. Gamified achievement badges 3. Adaptive difficulty based on performance 4. Visual learning aids and animations 5. Progress sharing capabilities). Add 3 points for each practical innovative feature implemented (maximum 10 points). Features should specifically enhance the science learning experience.",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple scoring systems coexisting) 2. Function modules unrelated to science education (e.g., built-in social media features) 3. Fancy effects that distract from learning (e.g., excessive animations that interfere with reading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core educational functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating game logic/UI/data layers), code organization, and maintainability. Deduct 5 points if global state pollution is found or proper separation of concerns is not implemented; deduct 5 points if the code duplication rate is too high (over 30%); deduct 3 points if variable naming and commenting are poor. The full score requires clean, well-documented, and maintainable code structure.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface design meet educational and aesthetic standards with proper light blue theme?",
      "description": "Evaluate whether the design follows educational interface principles with the specified light blue background: 1) Proper use of light blue theme without eye strain 2) Clear typography suitable for 5th graders (font size ≥ 16px) 3) Intuitive navigation and age-appropriate UI elements 4) Adequate contrast ratios for readability 5) Consistent visual hierarchy. Deduct 5 points for poor color implementation, 3 points for inadequate text readability, and 5 points for non-intuitive navigation design.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the user interaction smooth and educationally appropriate?",
      "description": "Judge whether the interactions are suitable for 5th grade students: 1) Response time ≤ 200ms for all interactions 2) Clear visual feedback for all user actions 3) Intuitive button placement and sizing 4) Smooth transitions that don't distract from learning 5) Accessible design considerations. Deduct 5 points for each interaction without proper feedback, 3 points for confusing navigation elements, and 5 points for interactions that hinder the learning process.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Puzzle",
  "difficulty": "easy"
}