{
  "index": 1072,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. High School Physics Knowledge Summary (People's Education Version)\n\nYou are a code expert. Please use your professional knowledge to generate accurate and professional responses. Try to ensure that the generated code is executable and displayable.\n\n---\n\n### I. Mechanics\n\n#### 1. Kinematics\n- **Key Concepts**:\n  - **Displacement**: Change in position of an object, a vector with both magnitude and direction.\n  - **Velocity**: Physical quantity describing the speed and direction of motion, a vector.\n  - **Acceleration**: Physical quantity describing the rate of change in velocity, a vector.\n- **Formulas**:\n  - Uniform Linear Motion: \\( v = \\frac{s}{t} \\)\n  - Uniformly Accelerated Linear Motion:\n    - Velocity Formula: \\( v = v_0 + at \\)\n    - Displacement Formula: \\( s = v_0t + \\frac{1}{2}at^2 \\)\n    - Velocity-Displacement Relationship: \\( v^2 - v_0^2 = 2as \\)\n- **Secondary Conclusions**:\n  - Average velocity in uniformly accelerated linear motion: \\( \\bar{v} = \\frac{v_0 + v}{2} \\)\n  - Displacement difference in consecutive equal time intervals: \\( \\Delta s = aT^2 \\)\n- **Understanding**:\n  - In uniformly accelerated linear motion, acceleration is constant, velocity and displacement change linearly with time.\n  - The velocity-displacement relationship formula is commonly used when initial velocity and acceleration are known to find displacement.\n\n#### 2. Newton's Laws\n- **Key Concepts**:\n  - **Force**: Interaction between objects, a vector.\n  - **Inertia**: Property of an object to maintain its state of motion.\n  - **Action and Reaction Forces**: Equal in magnitude, opposite in direction, acting on different objects.\n- **Formulas**:\n  - Newton's Second Law: \\( F = ma \\)\n  - Universal Gravitation Law: \\( F = G\\frac{Mm}{r^2} \\)\n- **Secondary Conclusions**:\n  - Acceleration of an object on an inclined plane: \\( a = g\\sin\\theta \\)\n  - Period of a spring oscillator: \\( T = 2\\pi\\sqrt{\\frac{m}{k}} \\)\n- **Understanding**:\n  - Newton's Second Law reveals the relationship between force and acceleration, the foundation of dynamics.\n  - The Universal Gravitation Law applies to any two objects with mass, explaining celestial motion.\n\n#### 3. Energy Conservation\n- **Key Concepts**:\n  - **Kinetic Energy**: Energy possessed by an object due to motion, \\( E_k = \\frac{1}{2}mv^2 \\).\n  - **Potential Energy**: Energy possessed by an object due to position or state, e.g., gravitational potential energy \\( E_p = mgh \\).\n  - **Conservation of Mechanical Energy**: In situations where only gravity or elastic forces do work, mechanical energy remains constant.\n- **Formulas**:\n  - Work-Energy Theorem: \\( W = \\Delta E_k = \\frac{1}{2}mv^2 - \\frac{1}{2}mv_0^2 \\)\n  - Conservation of Mechanical Energy: \\( E_k + E_p = \\text{constant} \\)\n- **Secondary Conclusions**:\n  - Final velocity of an object sliding down from rest on an inclined plane: \\( v = \\sqrt{2gh} \\)\n  - Conservation of momentum in elastic collisions: \\( m_1v_1 + m_2v_2 = m_1v_1' + m_2v_2' \\)\n- **Understanding**:\n  - The Work-Energy Theorem reveals the relationship between work and energy change.\n  - The Law of Conservation of Mechanical Energy is an important tool for solving mechanics problems.\n\n---\n\n### II. Electromagnetism\n\n#### 1. Electrostatic Field\n- **Key Concepts**:\n  - **Electric Field Intensity**: Physical quantity describing the strength of an electric field, \\( E = \\frac{F}{q} \\).\n  - **Potential Difference**: Difference in electric potential between two points in an electric field, \\( U = Ed \\).\n  - **Coulomb's Law**: Law describing the force between point charges.\n- **Formulas**:\n  - Electric Field Intensity: \\( E = \\frac{F}{q} \\)\n  - Potential Difference: \\( U = Ed \\)\n  - Coulomb's Law: \\( F = k\\frac{q_1q_2}{r^2} \\)\n- **Secondary Conclusions**:\n  - Electric field intensity of a point charge: \\( E = k\\frac{Q}{r^2} \\)\n  - Capacitance of a parallel plate capacitor: \\( C = \\frac{\\varepsilon S}{4\\pi kd} \\)\n- **Understanding**:\n  - Electric field intensity is a fundamental physical quantity describing electric field properties.\n  - Potential difference reflects energy changes in an electric field.\n\n#### 2. Steady Current\n- **Key Concepts**:\n  - **Electric Current**: Amount of charge passing through a conductor cross-section per unit time, \\( I = \\frac{Q}{t} \\).\n  - **Resistance**: The obstruction of a conductor to electric current, \\( R = \\frac{U}{I} \\).\n  - **Electric Power**: Rate at which work is done by electric current, \\( P = UI \\).\n- **Formulas**:\n  - Ohm's Law: \\( I = \\frac{U}{R} \\)\n  - Electric Power: \\( P = UI = I^2R = \\frac{U^2}{R} \\)\n- **Secondary Conclusions**:\n  - Total resistance in series circuits: \\( R = R_1 + R_2 + \\cdots + R_n \\)\n  - Total resistance in parallel circuits: \\( \\frac{1}{R} = \\frac{1}{R_1} + \\frac{1}{R_2} + \\cdots + \\frac{1}{R_n} \\)\n- **Understanding**:\n  - Ohm's Law is the basis for circuit analysis.\n  - Electric power reflects the efficiency of energy conversion in circuits.\n\n#### 3. Magnetic Field\n- **Key Concepts**:\n  - **Magnetic Induction**: Physical quantity describing the strength of a magnetic field, \\( B = \\frac{F}{IL} \\).\n  - **Ampere Force**: Force exerted on a current-carrying conductor in a magnetic field, \\( F = BIL\\sin\\theta \\).\n  - **Lorentz Force**: Force exerted on a charged particle in a magnetic field, \\( F = qvB\\sin\\theta \\).\n- **Formulas**:\n  - Ampere Force: \\( F = BIL\\sin\\theta \\)\n  - Lorentz Force: \\( F = qvB\\sin\\theta \\)\n- **Secondary Conclusions**:\n  - Radius of motion for a charged particle in a magnetic field: \\( r = \\frac{mv}{qB} \\)\n  - Effective value of alternating current: \\( I_{\\text{effective}} = \\frac{I_m}{\\sqrt{2}} \\)\n- **Understanding**:\n  - Ampere Force and Lorentz Force are important concepts in electromagnetism.\n  - The laws of motion for charged particles in magnetic fields are fundamental to particle accelerator research.\n\n---\n\n### III. Thermodynamics\n\n#### 1. Laws of Thermodynamics\n- **Key Concepts**:\n  - **Internal Energy**: Total kinetic and potential energy of molecules within an object.\n  - **First Law of Thermodynamics**: Expression of the law of energy conservation in thermodynamics.\n- **Formulas**:\n  - First Law of Thermodynamics: \\( \\Delta U = Q + W \\)\n  - Ideal Gas Law: \\( PV = nRT \\)\n- **Secondary Conclusions**:\n  - Work in isothermal processes: \\( W = nRT\\ln\\frac{V_2}{V_1} \\)\n  - Temperature change in adiabatic processes: \\( T_1V_1^{\\gamma-1} = T_2V_2^{\\gamma-1} \\)\n- **Understanding**:\n  - The First Law of Thermodynamics reveals basic principles of energy conversion.\n  - The Ideal Gas Law is an important tool for studying gas properties.\n\n#### 2. Heat Transfer\n- **Key Concepts**:\n  - **Heat Conduction**: Heat transfer through molecular motion within a substance.\n  - **Thermal Radiation**: Heat transfer through electromagnetic waves.\n- **Formulas**:\n  - Heat Conduction: \\( Q = kA\\frac{\\Delta T}{d} \\)\n  - Thermal Radiation: \\( P = \\sigma A T^4 \\)\n- **Secondary Conclusions**:\n  - Peak wavelength of blackbody radiation: \\( \\lambda_{\\text{max}} = \\frac{b}{T} \\)\n- **Understanding**:\n  - Heat conduction and thermal radiation are two main methods of heat transfer.\n  - Blackbody radiation laws are the basis for studying thermal radiation.\n\n---\n\n### IV. Optics\n\n#### 1. Geometric Optics\n- **Key Concepts**:\n  - **Law of Refraction**: Law governing light refraction at interfaces between two media.\n  - **Thin Lens Formula**: Formula describing image formation by lenses.\n- **Formulas**:\n  - Law of Refraction: \\( n_1\\sin\\theta_1 = n_2\\sin\\theta_2 \\)\n  - Thin Lens Formula: \\( \\frac{1}{f} = \\frac{1}{u} + \\frac{1}{v} \\)\n- **Secondary Conclusions**:\n  - Critical angle for total internal reflection: \\( \\sin\\theta_c = \\frac{n_2}{n_1} \\)\n  - Spacing of light interference fringes: \\( \\Delta x = \\frac{\\lambda D}{d} \\)\n- **Understanding**:\n  - The Law of Refraction is the basis for studying light propagation.\n  - The Thin Lens Formula is an important tool for analyzing lens imaging.\n\n#### 2. Wave Optics\n- **Key Concepts**:\n  - **Interference**: Light and dark fringes produced by the superposition of two coherent light waves.\n  - **Diffraction**: Wave phenomenon occurring when light passes through narrow slits or obstacles.\n- **Formulas**:\n  - Conditions for light interference: \\( \\Delta r = k\\lambda \\) (constructive), \\( \\Delta r = (k + \\frac{1}{2})\\lambda \\) (destructive)\n  - Light diffraction formula: \\( a\\sin\\theta = k\\lambda \\)\n- **Secondary Conclusions**:\n  - Position of dark fringes in single-slit diffraction: \\( a\\sin\\theta = k\\lambda \\)\n- **Understanding**:\n  - Interference and diffraction are important manifestations of light's wave nature.\n  - Interference patterns and diffraction patterns are important means to study the wave properties of light.\n\n---\n\n### V. Modern Physics\n\n#### 1. Quantum Mechanics\n- **Key Concepts**:\n  - **Photoelectric Effect**: Phenomenon of electron emission when light hits a metal surface.\n  - **De Broglie Wavelength**: Relationship between matter wave wavelength and momentum.\n- **Formulas**:\n  - Photoelectric Effect: \\( E_k = h\\nu - W \\)\n  - De Broglie Wavelength: \\( \\lambda = \\frac{h}{p} \\)\n- **Secondary Conclusions**:\n  - Hydrogen atom energy level formula: \\( E_n = -\\frac{13.6}{n^2} \\text{eV} \\)\n- **Understanding**:\n  - The photoelectric effect reveals the particle nature of light.\n  - De Broglie wavelength is the basis for studying the wave nature of matter.\n\n#### 2. Relativity\n- **Key Concepts**:\n  - **Mass-Energy Equation**: Equivalence relationship between mass and energy.\n  - **Time Dilation**: Phenomenon of moving clocks slowing down.\n- **Formulas**:\n  - Mass-Energy Equation: \\( E = mc^2 \\)\n  - Time Dilation: \\( \\Delta t' = \\gamma\\Delta t \\)\n- **Secondary Conclusions**:\n  - Energy-momentum relationship in relativity: \\( E^2 = (pc)^2 + (m_0c^2)^2 \\)\n- **Understanding**:\n  - The mass-energy equation reveals the intrinsic connection between mass and energy.\n  - Time dilation is one of the important effects of relativity.\n\n---\n\n### Summary\nThe above is a detailed summary of high school physics knowledge points from the People's Education Version, covering mechanics, electromagnetism, thermodynamics, optics, and modern physics. Each knowledge point includes formulas, secondary conclusions, and understanding of important concepts to help comprehensively master physics knowledge. If further organization into code or graphical representation is needed, it can be extended based on this foundation.\n\nCan you make this into a webpage?",
  "checklist": [
    {
      "id": 0,
      "title": "Is the webpage structure correctly implemented?",
      "description": "Check whether the HTML structure follows proper semantic hierarchy with appropriate heading levels (h1, h2, h3), section divisions, and navigation. The structure should organize the physics content logically by main categories (Mechanics, Electromagnetism, Thermodynamics, Optics, Modern Physics) and their subcategories. Score 0 if there's no clear structure, 5 if basic structure exists but with semantic errors, 10 if fully and correctly implemented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are mathematical formulas properly rendered?",
      "description": "Evaluate the implementation of mathematical formulas. Physics formulas should be correctly rendered using MathJax/KaTeX or equivalent libraries, maintaining proper notation, symbols, and layout. Check if formulas like Newton's laws, energy equations, electromagnetic principles are displayed with proper subscripts, superscripts, and special symbols. Deduct 2 points for each incorrectly rendered formula type, with complete failure scoring 0 and perfect implementation scoring 10.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is interactive physics visualization implemented?",
      "description": "Review whether the code includes interactive visualizations for key physics concepts (e.g., projectile motion, electrical circuits, wave interference). Each major section should have at least one interactive demonstration. Score 3 points per quality interactive visualization (up to 10 points). Visualizations should accurately represent the physics concepts, be manipulable by users, and provide educational value. No visualizations score 0 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the implementation include a knowledge mapping system?",
      "description": "Examine whether the code implements a visual knowledge mapping system that shows relationships between physics concepts (e.g., how Newton's laws relate to energy conservation, or how wave-particle duality connects quantum mechanics and optics). Score 0 if absent, 5 if a basic concept map exists but lacks interactivity or comprehensive coverage, and 10 if the implementation includes an interactive, comprehensive knowledge map with clear relationship indicators.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (browser compatibility issues, slow loading of mathematical rendering libraries, device-specific display problems) and provide fallback mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the learning experience (e.g., 1. Interactive quizzes tied to formula comprehension 2. Physics formula calculator tools 3. Historical context sidebars for physics discoveries 4. Animated examples of physical phenomena). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Duplicate explanations of the same concept in multiple sections 2. Excessive animations that don't contribute to understanding physics concepts 3. Unnecessary script libraries that slow down page loading. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core content is obscured by redundant elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of content/presentation/behavior layers), code reusability for similar physics sections, and performance optimization. Deduct 5 points if global script variables pollute the namespace; deduct 5 points if similar physics formulas use completely different rendering approaches; deduct 5 points if the page loading time exceeds 3 seconds due to inefficient code. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern educational design principles: 1) Harmonious color scheme appropriate for scientific content 2) Proper white space and content density 3) Professional typography with clear hierarchy (formula text vs. explanatory text). Deduct 3 points for each visual inconsistency between sections, 5 points for poor readability of formulas, and 5 points for lack of visual distinction between physics concept categories. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the interactive elements conform to good UX principles: 1) Responsive formula rendering (≤ 500ms) 2) Smooth transitions between physics topic sections 3) Clear visual indication of interactive vs. static elements. Deduct 5 points if formula interactions have noticeable lag, 3 points if navigation between physics sections is jarring, and 5 points if users would struggle to identify which elements are interactive. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}