{
  "index": 1242,
  "question": "You are a coding expert. Please use your professional knowledge to generate accurate, professional responses. Make sure the code you generate is executable for demonstration. Design a page that can print calligraphy stroke practice content.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the calligraphy stroke practice system fully implemented?",
      "description": "Evaluate whether the code implements core calligraphy features including stroke display, character grid systems, stroke sequence demonstration, and stroke-by-stroke practice capability. Score 0 if no stroke rendering exists, 5 if only static character display is implemented, and 10 if complete interactive stroke practice with animation guidance is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the printing functionality properly implemented?",
      "description": "Check if the code includes proper CSS @media print rules, print-optimized layouts, page breaks control, and print preview functionality. Deduct 3 points if the print layout breaks, 5 points if there's no print-specific styling, and 2 points if the printed output differs significantly from the screen display. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the calligraphy character customization feature implemented?",
      "description": "Review whether users can customize the calligraphy content (character selection, style selection, grid size, stroke thickness, etc.). Score 10 for comprehensive customization options with preview capability, 5 for basic customization without preview, and 3 if only preset templates are available with minimal adjustments.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the system provide proper practice guidance mechanisms?",
      "description": "Assess if the system includes features like stroke order visualization, proper spacing guides, writing direction indicators, and possibly animation demonstrations. Deduct 5 points if stroke order is missing, 3 points if guide lines aren't customizable, and 2 points if there's no visual feedback mechanism for practice. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code handles common edge cases (such as browser compatibility issues, device orientation changes, print errors, unsupported character inputs, etc.) and provides friendly error messages or fallbacks. Code with strong robustness should effectively handle these situations, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Look for surprise features that enhance the experience (e.g., 1. Brush pressure simulation with pointer events 2. Animated stroke demonstrations with timing control 3. Progress tracking system for practice 4. Handwriting recognition for feedback). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Duplicate functionality implemented in multiple ways 2. Features unrelated to calligraphy practice or printing 3. Decorative elements that hinder the primary learning function. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core calligraphy practice functions are obscured by unnecessary features.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review the modular design (separation of rendering engine, character data, user interface, and print functionality), reusability of components, and performance optimization for both screen and print media. Deduct 5 points if global variables are overused; deduct 5 points if the code isn't organized into logical components; deduct 5 points if print rendering performance isn't optimized. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards for calligraphy practice?",
      "description": "Evaluate whether the design follows calligraphy practice principles: 1) Clear contrast between strokes and background 2) Proper grid spacing that follows traditional practice sheet proportions 3) Professional typography with appropriate spacing between characters. Deduct 3 points for poor stroke visibility, 5 points for improper grid sizing that makes practice difficult, and 5 points for cluttered interface elements that distract from practice. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the print output optimized for actual practice use?",
      "description": "Judge whether the printed output is practical for real calligraphy practice: 1) Ink-saving design options 2) Appropriate stroke density and visibility on paper 3) Page format optimization for standard paper sizes. Deduct 5 points if the print output wastes excessive ink, 3 points if the printed stroke guides are too faint or too dark for practical use, and 5 points if the layout doesn't properly account for paper margins or standard sizes. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "medium"
}