{
  "index": 1315,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable when possible. Write an HTML webpage code with MBTI as the theme, and include images.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the MBTI theme fully implemented in the webpage?",
      "description": "Evaluate whether the webpage effectively incorporates MBTI concepts, including clear explanations of the 4 key dichotomies (E/I, S/N, T/F, J/P) and 16 personality types. Score 0 if MBTI concepts are absent, 5 if only basic mention without explanation, and 10 if comprehensive MBTI framework is presented with personality descriptions.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are appropriate images incorporated for MBTI visualization?",
      "description": "Check if the code includes relevant images for MBTI types (such as type icons, characteristic illustrations, or representative figures). Images should have proper alt text, responsive sizing, and meaningful correlation to MBTI content. Deduct 3 points if images are unrelated to MBTI, 3 points if alt text is missing, and 5 points if no images are included at all.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there interactive MBTI functionality implemented?",
      "description": "Assess whether the webpage includes interactive elements like personality quizzes, type comparison tools, or dynamic type descriptions. Score 0 if no interactivity exists, 5 if basic interactivity (like simple hover effects) is present, and 10 if comprehensive interactive features (like a working MBTI assessment) are implemented.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is personalized content based on MBTI types provided?",
      "description": "Review whether the webpage offers customized content based on MBTI types, such as career recommendations, relationship compatibility, or personal development advice. Deduct 5 points if personalization is completely absent, and 3 points if only shallow personalization exists. Award full 10 points if deep, research-backed personalized content is presented.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing images, different screen sizes, browser compatibility issues, etc.) and provide fallback solutions. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Visual type matching animations 2. Interactive type compatibility charts 3. Personality archetype visualizations). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple ways to display the same type descriptions) 2. Function modules unrelated to MBTI (e.g., unrelated social media feeds) 3. Fancy effects that affect performance (e.g., excessive animations that slow down page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core MBTI content is interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating content/style/behavior), semantic HTML usage, CSS organization, and JavaScript best practices. Deduct 5 points if CSS is inline rather than in a stylesheet; deduct 5 points if the code contains duplicated functions or styles; deduct 5 points if there's no responsive design implementation. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}