{
  "index": 1474,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable for demonstration purposes. Create a VALORANT tutorial page using HTML, embedding multimedia (video and audio).",
  "checklist": [
    {
      "id": 0,
      "title": "Is the VALORANT tutorial content structure comprehensively implemented?",
      "description": "Review whether the HTML structure includes complete tutorial sections covering core VALORANT gameplay elements: agent abilities, weapon mechanics, map knowledge, and tactical strategies. Check if content is organized with proper semantic HTML5 tags (section, article, nav, aside). Score 0 if basic tutorial structure is missing, 5 if only partial content sections are implemented, and 10 if all major tutorial categories are comprehensively covered with logical content hierarchy.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the multimedia integration (video/audio) properly implemented and optimized?",
      "description": "Evaluate whether video and audio elements are correctly embedded with appropriate formats (MP4/WebM for video, MP3/OGG for audio), include fallback options, and have proper controls. Check for autoplay policies compliance, loading optimization (lazy loading, preload attributes), and accessibility features (captions, audio descriptions). Deduct 5 points if no fallback formats provided, 3 points if accessibility features missing, and 5 points if loading performance is poor. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the interactive tutorial navigation and progress tracking system implemented?",
      "description": "Check whether the tutorial includes interactive navigation elements, progress indicators, and user progress tracking mechanisms. Evaluate if users can jump between tutorial sections, bookmark progress, and receive completion feedback. Assess if the navigation is intuitive with breadcrumbs, chapter selection, and smooth scrolling. Deduct 5 points if progress tracking is missing, 3 points if navigation is confusing, and 5 points if no interactive elements are present. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the VALORANT-specific visual theming and branding authentically implemented?",
      "description": "Evaluate whether the page design authentically reflects VALORANT's visual identity including color schemes (teal/red accent colors), typography matching game aesthetics, and UI elements consistent with game interface. Check for proper use of game assets, iconography, and layout patterns that mirror the game's design language. Give 10 points if fully authentic to VALORANT branding, 5 points if partially consistent, and 0 points if generic gaming design without VALORANT-specific elements.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as media loading failures, browser compatibility issues, network interruptions, and user interaction errors) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should include error handling for media elements, graceful degradation for unsupported features, and proper validation. Give 10 points if fully robust, 5 points if average robustness, and 0 points if no exception handling.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the tutorial experience (e.g., 1. Interactive agent ability demonstrations 2. Mini-games for aim training 3. Real-time strategy quiz elements 4. 3D weapon inspection viewer 5. Voice-over narration with professional casting). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple video players for same content) 2. Function modules unrelated to VALORANT tutorials (e.g., unrelated game content or social media feeds) 3. Excessive animations that distract from learning content. Deduct 3 points for each redundancy found, and directly deduct 10 points if core tutorial functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separating content/styling/interaction layers), semantic HTML structure, CSS organization, and JavaScript modularity. Check for proper file organization, comment documentation, and maintainable code structure. Deduct 5 points if poor separation of concerns or inline styles dominate; deduct 5 points if code duplication rate is high (over 30%); deduct 5 points if no documentation or comments provided. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern web design principles: 1) Harmonious color matching consistent with VALORANT branding (no more than 4 primary colors) 2) Proper layout spacing (element spacing follows 8px grid system) 3) Professional typography (body font ≥ 16px, line height ≥ 1.5, proper contrast ratios) 4) Responsive design for different screen sizes. Deduct 3 points for each crowded visual element, 5 points for poor color contrast or accessibility issues, and 5 points for non-responsive layout. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the multimedia interaction smooth and seamless?",
      "description": "Judge whether multimedia elements and interactions conform to user experience standards: 1) Video/audio loading feedback with progress indicators 2) Smooth playback controls with ≤100ms response time 3) Proper volume controls and mute functionality 4) Clear visual focus states for interactive elements 5) Seamless transitions between tutorial sections. Deduct 5 points for each media element without proper controls, 3 points for laggy interactions, and 5 points for unclear navigation states. Full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "medium"
}