{
  "index": 1582,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable and demonstrable. Please help me create a webpage about traditional intangible cultural heritage, featuring content about embroidery, lion dance, and the art of striking molten iron to create sparks (Da Tie Hua), including descriptions and rich visual elements.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the webpage structure properly implemented with semantic HTML?",
      "description": "Review whether the HTML structure uses appropriate semantic elements (header, nav, main, section, article, footer) for better accessibility and SEO. Check if the document has proper DOCTYPE, html, head, and body tags with appropriate meta tags and title. Score 0 if the structure is chaotic, 5 if basic structure is present but with semantic issues, and 10 if semantic HTML is properly implemented with clear document hierarchy.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the three cultural heritage elements (embroidery, lion dance, Da Tie Hua) comprehensively presented?",
      "description": "Check whether each cultural heritage element has adequate informational content including historical background, cultural significance, regional variations, and current status. Each element should have at least 200 words of descriptive content. Deduct 3 points for each element that lacks comprehensive information, and 2 points for each element missing key aspects of its cultural significance. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are visual elements rich and properly implemented?",
      "description": "Evaluate the visual presentation for each cultural heritage element. Each should include at least 2 images with proper alt text, and at least one of the heritage elements should feature an advanced visual component (animation, video, interactive element, or SVG illustration). Deduct 3 points for each heritage element lacking sufficient visuals, and 5 points if no advanced visual elements are implemented. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there any interactive element to enhance user engagement?",
      "description": "Assess whether the webpage includes interactive elements such as image galleries, expandable content sections, animations triggered by user actions, quizzes about cultural heritage, or other interactive features that enhance user engagement. Score 0 if no interactivity exists, 5 if basic interactivity is implemented (like simple hover effects), and 10 if multiple well-implemented interactive features are present that genuinely enhance the learning experience about cultural heritage.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as image loading failures, browser compatibility issues, responsive layout breakpoints, etc.) and provide fallback mechanisms. Code with strong robustness should include error handling for JavaScript functions, responsive image handling, and CSS fallbacks. Give 10 points for comprehensive robustness, 5 points for average handling, and 0 points if no error handling or fallbacks exist.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Cultural heritage timeline with interactive navigation 2. Region-based interactive map showing where each heritage originates 3. Animated demonstrations of techniques used in these art forms). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple image carousel implementations) 2. Function modules unrelated to cultural heritage (e.g., unnecessary social media integrations) 3. Fancy effects that affect performance (e.g., heavy animations that slow page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core content is obscured by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating structure/style/behavior with proper HTML/CSS/JS organization), code reusability, and performance optimization. Deduct 5 points if styles are mostly inline rather than in CSS files; deduct 5 points if JavaScript is not properly organized or contains global namespace pollution; deduct 5 points if assets are not optimized (uncompressed images, unminified code). The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles and reflects the aesthetic of traditional cultural heritage: 1) Harmonious color scheme appropriate for the cultural context 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Typography that enhances readability while reflecting cultural elements. Deduct 3 points for each crowded visual element, 5 points for inappropriate color combinations that don't respect the cultural context, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the webpage responsive and accessible?",
      "description": "Judge whether the webpage is properly viewable across devices (mobile, tablet, desktop) and accessible to users with disabilities: 1) Responsive layout using media queries or flexible grid systems 2) Proper contrast ratios for text readability 3) Accessibility features like ARIA labels, keyboard navigation support, and screen reader compatibility. Deduct 5 points for non-responsive layouts, 3 points for each major accessibility issue, and 5 points for completely inaccessible interactive elements. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}