{
  "index": 1638,
  "question": "You are a coding expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you produce is executable for demonstration. Create an HTML webpage about Genshin Impact.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core Genshin Impact content accurately represented?",
      "description": "Review whether the HTML page includes essential Genshin Impact elements: main characters, regions, game mechanics, and lore. Score 0 if barely recognizable as Genshin Impact, 5 if only basic elements are present, and 10 if comprehensive content (characters, elements, weapons systems, regions) is included with accurate details.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the visual design consistent with Genshin Impact's aesthetic?",
      "description": "Evaluate if the color scheme, typography, and design elements match the game's distinct visual style. Check for Genshin's characteristic fantasy elements, elemental colors, and the distinctive UI patterns. Deduct 5 points if the color scheme contradicts the game's palette, 3 points if fonts don't reflect the game's style, and 5 points if no game-specific visual elements are incorporated.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is interactive content related to the game implemented?",
      "description": "Check for interactive elements like character profiles, element switchers, or wish simulators. Score 0 if no interactivity exists, 5 if basic hover/click interactions are implemented, and 10 if complex game-related interactions (e.g., character showcase with animations, interactive map, or element reaction demonstrations) are fully functional.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is responsive design properly implemented for multiple devices?",
      "description": "Assess if the page displays correctly across desktop, tablet, and mobile devices using media queries. Check if images are optimized for different screen sizes and if interactive elements remain functional on touch devices. Deduct 5 points if the layout breaks on mobile, 3 points if images aren't responsive, and 5 points if interactive elements are unusable on certain devices.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as image loading failures, JavaScript errors, user input validation) and provide fallbacks or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Element reaction animations 2. Background music toggle with game soundtracks 3. Dynamic time-of-day changes like in-game). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple navigation systems) 2. Function modules unrelated to Genshin Impact 3. Fancy effects that affect performance (e.g., excessive animations that slow page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core content is interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating content/style/behavior with proper HTML/CSS/JS organization), code readability, and resource optimization. Deduct 5 points if inline styles are overused; deduct 5 points if JavaScript is unstructured or mixed with HTML; deduct 5 points if assets are not optimized for web delivery. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern web design principles: 1) Harmonious color matching consistent with Genshin's palette 2) Proper layout spacing with clear visual hierarchy 3) Professional font system that maintains readability while reflecting the game's aesthetic. Deduct 3 points for each crowded visual element, 5 points for conflicting color combinations, and 5 points for disorganized content structure. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animations controlled between 300-500ms 3) Clear visual cues for interactive elements. Deduct 5 points for each operation without feedback, 3 points for janky animations, and 5 points for confusing navigation patterns. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}