{
  "index": 1646,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration purposes. Use an HTML demo to visualize basic knowledge in the automotive field.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the automotive knowledge visualization comprehensive?",
      "description": "Evaluate whether the HTML demo covers key automotive concepts (e.g., engine types, car parts, drivetrain systems, safety features). Score 0 if minimal content is presented, 5 if basic concepts are covered, and 10 if comprehensive automotive knowledge with proper categorization is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the interactive visualization effectively implemented?",
      "description": "Check if the demo includes interactive elements like hoverable components, clickable car parts, expandable information sections, or animated demonstrations of automotive systems. Deduct 5 points if only static content is presented. Award full points if the visualization allows users to interact with multiple automotive concepts in an intuitive manner.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the technical accuracy of automotive information maintained?",
      "description": "Verify that the automotive information presented is technically accurate. Check for correct terminology, accurate descriptions of automotive systems, and proper relationships between components. Deduct 3 points for each significant factual error. The visualization should maintain educational value through technical precision.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the visual representation clear and instructive?",
      "description": "Assess whether diagrams, illustrations or models clearly represent automotive concepts. Evaluate if visual aids enhance understanding rather than causing confusion. Check for proper labeling, appropriate use of colors for differentiation, and logical visual hierarchy. Deduct 3 points if visuals are unclear or misleading.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser compatibility issues, resizing windows, touch vs. mouse interactions) and provide responsive design. Code with strong robustness should degrade gracefully across devices, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. 3D interactive car models 2. Real-time physics simulations of automotive systems 3. Comparison tools for different vehicles or components). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant explanations of the same automotive concepts 2. Function modules unrelated to automotive knowledge 3. Fancy effects that affect performance without educational value. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core educational content is obscured by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/view/interaction layers), code organization, and performance optimization. Deduct 5 points if global variables are overused; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if resource loading isn't optimized for performance. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during animations, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}