{
  "index": 1668,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration purposes. Write a college entrance examination application software.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core college application form functionality implemented?",
      "description": "Review whether the code implements a comprehensive application form that captures all essential student information (personal details, academic records, extracurricular activities, essay submissions). Score 0 if the form functionality is missing, 5 if only basic fields are implemented, and 10 if the form is complete with validation.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Does the system include college search and comparison features?",
      "description": "Evaluate whether users can search for colleges based on multiple criteria (location, major, acceptance rate, etc.) and compare institutions side-by-side. The system should provide filterable results and detailed college profiles. Deduct 5 points if search functionality is rudimentary, 3 points if comparison features are missing. Full score for comprehensive implementation.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there application tracking and status management?",
      "description": "Check if the system allows users to track multiple applications, view submission status, deadlines, and receive notifications. The tracking dashboard should provide visual indicators of progress. Deduct 5 points if status updates are manual only, 3 points if deadline management is missing. Full score requires an automated tracking system with timeline visualization.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the software include document management for application materials?",
      "description": "Assess whether the system allows uploading, storing, and organizing required documents (transcripts, recommendation letters, essays, etc.). Document preview, tagging, and version control should be present. Deduct 5 points if file format support is limited, 3 points if document organization features are missing. Give 10 points if fully implemented with cloud storage integration.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (invalid form inputs, network interruptions, file upload failures, etc.) and provide friendly error messages or recovery mechanisms. Code with strong robustness should effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. AI-powered essay feedback 2. Virtual college tours 3. Admission probability calculator based on historical data). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple user profile sections) 2. Function modules unrelated to college applications (e.g., a built-in game) 3. Fancy effects that affect performance (e.g., unnecessary animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/UI/business logic layers), unit test coverage, and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast scrolling, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "hard"
}