{
  "index": 1761,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to provide executable code in your demonstration. Design a webpage code for Xi'an cuisine.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the Xi'an cuisine webpage layout properly structured?",
      "description": "Evaluate if the webpage has a clear HTML5 semantic structure with proper header, navigation, main content sections, and footer. Check if the layout adapts to different screen sizes (responsive design) with media queries. Give 10 points for perfect structure with semantic HTML5 elements, 5 points for basic structure without responsiveness, 0 points if critical structural elements are missing.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are Xi'an cuisine dishes comprehensively presented?",
      "description": "Review whether the code includes presentation of at least 5 signature Xi'an dishes (e.g., Biang Biang noodles, Roujiamo, Liangpi, Paomo, etc.) with accurate descriptions, images, and cultural context. Each dish should have proper categorization, ingredient information, and preparation methods. Give 10 points for comprehensive coverage, 5 points if only basic information is provided, 0 points if fewer than 3 signature dishes are included.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there interactive functionality for user engagement?",
      "description": "Check if the code implements interactive elements such as dish filtering/sorting, image galleries/carousels, recipe expansion/collapse, interactive maps of Xi'an food streets, or user rating systems. Award 10 points for 3+ well-implemented interactive features, 5 points for basic interactivity, 0 points if no JavaScript interaction is implemented.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the webpage incorporate cultural elements of Xi'an?",
      "description": "Evaluate if the website design integrates cultural elements specific to Xi'an (Terracotta Army, city wall, Muslim Quarter, etc.) through visual design elements, typography, color schemes, or background patterns. Check for historical context about Xi'an's culinary traditions. Give 10 points for deep cultural integration, 5 points for superficial references, 0 points if cultural context is absent.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as image loading failures, form validation, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive cooking process animations 2. Virtual tour of Xi'an food streets 3. Audio pronunciations of dish names in local dialect). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple image gallery implementations) 2. Function modules unrelated to Xi'an cuisine (e.g., non-food related content) 3. Fancy effects that affect performance (e.g., excessive animations that slow page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating HTML structure, CSS styling, and JavaScript functionality), code organization, and maintainability. Deduct 5 points if inline styles are extensively used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if JavaScript is not properly organized or lacks comments. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching reflecting Xi'an's cultural palette (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance when navigating through dishes or categories. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}