{
  "index": 288,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable when possible.\n\nHello, I am a teacher teaching 7th grade in Nanshan District, Shenzhen. Please help me create a teaching website using HTML with the following requirements:\n\n1. Include a map of Asia that displays all rivers mentioned in the textbook and labels the countries.\n2. Allow switching between subjects (Chinese Language Arts, History, Geography).\n3. In Geography mode, allow switching between topographical maps, precipitation maps, temperature maps, and climate maps. When clicking on map legends, explanations should appear (for example, when clicking on the subtropical monsoon climate zone (or its legend), it should display that the characteristic of subtropical monsoon climate is that rain and heat occur in the same period).\n4. In Chinese Language Arts mode, mark the writing locations of each text (excluding those not in Asia) and display complete information about the text (including appreciation) when clicked.\n5. In History mode, allow selection of dynasties, focus the view on China and label surrounding countries (excluding those not mentioned in the textbook), while displaying Chinese territories and key knowledge points according to the dynasty.\n6. Add a \"QR Code\" option in the top right corner that, when clicked, generates a QR code that allows direct access to the website when scanned.",
  "checklist": [
    {
      "id": 0,
      "title": "Asia Map Implementation",
      "description": "Evaluate the implementation of the Asia map feature which should display all rivers mentioned in textbooks and label countries correctly.0 points if map is missing or severely distorted, 5 points if basic outlines exist but rivers or countries are incomplete, 10 points for complete and accurate implementation with clear labeling and good responsiveness.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Subject Switching Mechanism",
      "description": "Assess the functionality that allows switching between Chinese Language Arts, History, and Geography subjects.0 points if switching mechanism is absent, 5 points if basic switching exists but with glitches or inconsistencies, 10 points for seamless transitions with proper state management and visual feedback.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Geography Mode Functionality",
      "description": "Evaluate the Geography mode's capability to switch between map types and provide explanations when legends are clicked.0 points if map types are missing or explanations don't appear, 5 points if basic switching exists but explanations are incomplete, 10 points for fully functional implementation with comprehensive educational content.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Chinese Language Arts Mode",
      "description": "Assess the implementation of marking writing locations of texts in Asia and displaying complete information when clicked.0 points if location marking is absent or severely inaccurate, 5 points if basic marking exists but information is limited, 10 points for comprehensive implementation with rich educational content.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Code Robustness",
      "description": "Evaluate whether the code can handle common abnormal situations and provide friendly error handling.0 points if no exception handling exists, 5 points if basic error handling is implemented but not comprehensive, 10 points for robust error handling with user-friendly recovery mechanisms.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Innovative Educational Features",
      "description": "Identify any eye-catching innovative features that enhance the educational experience.Add 3 points for each practical innovative feature implemented that enhances educational value (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Feature Redundancy Assessment",
      "description": "Strictly check for redundant or unnecessary features that might complicate the educational experience.Deduct 3 points for each redundancy found, and directly deduct 10 points if core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Engineering Quality",
      "description": "Review the code architecture, modularity, and maintainability.Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if code duplication rate is high; deduct 5 points if resource loading is inefficient. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Interface Design Quality",
      "description": "Evaluate whether the interface design meets professional standards appropriate for educational content.Deduct 3 points for each crowded visual element, 5 points for inappropriate color combinations for educational content, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Interactive Experience Quality",
      "description": "Judge whether the dynamic interactions are smooth, intuitive and support the educational purpose.Deduct 5 points for operations without feedback, 3 points for choppy animations, and 5 points for difficult-to-locate key educational functions. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "medium"
}