{
  "index": 1796,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration. Create a website using HTML that helps users independently configure cost-effective weapons in the Delta game.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the weapon configuration system fully implemented?",
      "description": "Review whether the code accurately implements weapon categories, attributes, and attachment systems through HTML/JavaScript. Check if it includes comprehensive weapon stats (damage, accuracy, range, etc.), attachment compatibility validation, and real-time stat calculation when configurations change. Score 0 if core weapon data structure is missing, 5 if only basic weapon display is implemented, and 10 if complete configuration system with all Delta game weapons and attachments is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the cost-effectiveness analysis algorithm implemented?",
      "description": "Check whether the system includes intelligent cost-performance ratio calculations based on weapon price, performance metrics, and user preferences. Evaluate if it provides ranking algorithms, comparison matrices, and budget optimization suggestions. Deduct 5 points if price-performance calculation is overly simplistic, and 3 points if no comparative analysis between different configurations is provided. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the interactive configuration interface design user-friendly?",
      "description": "Evaluate whether the configuration interface provides intuitive drag-and-drop functionality, real-time preview, and step-by-step guidance. Check if users can easily browse weapon categories, apply filters, and see immediate feedback on stat changes. Deduct 5 points if the configuration process requires more than 3 clicks for basic operations. Check whether save/load preset configurations are available. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the weapon data management system comprehensive?",
      "description": "Check whether the code includes complete weapon database with accurate Delta game data, including all weapon classes, attachment compatibility matrices, and current market prices. Evaluate if data is structured efficiently and updates can be managed easily. Deduct 5 points if weapon data is incomplete or inaccurate, and 3 points if no data validation mechanism exists. Give 10 points if fully implemented with real-time data sync capability.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid weapon combinations, missing data, user input errors, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the user experience (e.g., 1. AI-powered weapon recommendations based on playstyle 2. Build sharing and community rating system 3. Performance simulation in different game scenarios 4. Price tracking and deal alerts). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple filtering systems coexisting) 2. Function modules unrelated to weapon configuration (e.g., built-in chat system) 3. Fancy effects that affect performance (e.g., excessive 3D animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core configuration functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data layer/business logic/presentation layer), code organization, and maintainability. Deduct 5 points if global state pollution is found or no structured architecture is used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if no error handling or logging mechanisms exist. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern web design principles: 1) Harmonious color matching with gaming aesthetic (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional typography system (body font size ≥ 14px, line height over 1.5 times) 4) Clear visual hierarchy for weapon categories and stats. Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Configuration changes reflect immediately (≤ 100ms) 2) Transition animations between weapon views controlled between 300-500ms 3) Clear visual feedback for all interactive elements 4) Smooth scrolling and filtering operations. Deduct 5 points for each operation without visual feedback, 3 points for laggy animations during configuration changes, and 5 points for hard-to-find key configuration options. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "medium"
}