{
  "index": 741,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration purposes. Create a runnable laboratory website template.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the laboratory website structure properly implemented?",
      "description": "Evaluate whether the HTML structure follows semantic markup principles with proper use of <header>, <nav>, <main>, <section>, <footer> tags. Check if the document includes essential meta tags for SEO and responsive design. Deduct 3 points if semantic HTML5 elements are not used; deduct 3 points if the responsive meta viewport tag is missing; deduct 4 points if the document structure is illogical. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the navigation and information architecture well-designed?",
      "description": "Assess whether the site includes essential laboratory website sections (Home, Research, Team, Publications, Resources, Contact) with logical organization and clear navigation paths. Navigation should be accessible both on desktop and mobile. Deduct 3 points if key sections are missing; deduct 4 points if the navigation is not responsive; deduct 3 points if there's no visual indication of current page. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the website feature research presentation capabilities?",
      "description": "Check whether the website includes components for showcasing research projects, such as project cards, publication listings, or interactive demonstrations. There should be clear categorization of research areas and filtering capabilities. Deduct 5 points if research presentation is limited to static text; deduct 5 points if there's no visual representation of research data/projects. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there functionality for team member profiles and academic credentials?",
      "description": "Evaluate if the website includes a team section with proper profile structure (photo, name, position, research interests, contact info, publications links). Check if there's a hierarchical representation of lab leadership, researchers, students, and alumni. Deduct 3 points if profiles lack academic credentials; deduct 4 points if the layout doesn't scale for different team sizes; deduct 3 points if there's no individual profile page template. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing images, varied content lengths, browser compatibility issues, etc.) and provide graceful fallbacks. Check for form validation if contact forms are implemented. Deduct 3 points for each unhandled edge case; deduct 5 points if the site breaks completely on older browsers. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive research visualizations 2. Publication citation generator 3. Lab equipment booking system 4. Research timeline). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple navigation systems) 2. Function modules unrelated to academic/laboratory context 3. Fancy effects that affect performance (e.g., excessive animations that distract from content). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating layout/components/styles), CSS organization (consistent naming convention, preferably BEM or similar), and JavaScript structure (event delegation, proper module pattern). Deduct 5 points if global CSS/JS pollution is found; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there's no separation of concerns. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional academic standards?",
      "description": "Evaluate whether the design follows professional academic website standards: 1) Clean, credible appearance with appropriate whitespace 2) Academic color scheme (typically institutional colors or conservative palettes) 3) Professional typography (readable fonts, proper hierarchy, line length ≤80 characters). Deduct 3 points for cluttered layouts, 5 points for inappropriate color schemes for academic context, and 5 points for poor typography that reduces readability. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the site accessible and responsive across devices?",
      "description": "Judge whether the website meets accessibility standards (WCAG) and performs well across device sizes: 1) Proper contrast ratios and focus states 2) Responsive layouts that adapt from mobile to desktop 3) Content readability on all screen sizes. Deduct 4 points for non-responsive layouts; deduct 3 points for each major accessibility violation (missing alt text, keyboard navigation issues); deduct 3 points for poor performance on mobile devices. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Education/Learning",
  "difficulty": "easy"
}