{
  "index": 1082,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure that the code you generate is executable for display purposes. Help me write a web page in HTML that serves as the official website for Dormitory Room 414, and ensure the encoding format is GB2312.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the HTML structure semantically correct and follows GB2312 encoding?",
      "description": "Review whether the HTML uses proper semantic tags (header, nav, main, section, footer) and includes correct GB2312 encoding declaration in meta charset. Check if Chinese characters display correctly without garbled text. Score 0 if encoding is incorrect or semantic structure is missing, 5 if basic structure exists but semantic tags are incomplete, and 10 if fully semantic HTML with proper GB2312 encoding is implemented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Does the website contain complete dormitory-themed content sections?",
      "description": "Check whether the website includes essential sections for a dormitory official website: member introductions, dormitory life showcase, activity records, contact information, and dormitory rules/culture. Each section should have meaningful placeholder content or real content. Deduct 2 points for each missing core section. Score 10 if all sections are comprehensive and well-organized.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the navigation system intuitive and functional?",
      "description": "Evaluate whether the navigation menu is clearly structured with smooth anchor links or page transitions. Check for breadcrumb navigation, active state indicators, and mobile-responsive navigation collapse. Deduct 3 points if navigation links don't work, 2 points if no active states are shown, and 2 points if mobile navigation is not considered. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are interactive elements and dynamic features properly implemented?",
      "description": "Check if the website includes interactive features like image galleries, contact forms, comment sections, or interactive dormitory member cards. Evaluate JavaScript functionality for dynamic content loading, form validation, and user interactions. Score 0 if no interactive elements exist, 5 if basic interactions are present but limited, and 10 if comprehensive interactive features enhance user engagement.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing images, form validation errors, browser compatibility issues, etc.) and provide friendly error prompts or fallback mechanisms. Code with strong robustness should effectively handle edge cases and provide graceful degradation. Give 10 points if fully robust, 5 points if average robustness, and 0 points if no error handling exists.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that enhance the dormitory website experience?",
      "description": "Check whether the code includes creative features that make the dormitory website stand out (e.g., 1. Interactive dormitory floor plan 2. Member mood/status indicators 3. Shared calendar for dormitory activities 4. Photo timeline of dormitory memories 5. Virtual guest book). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple contact forms) 2. Function modules unrelated to dormitory life (e.g., e-commerce functionality) 3. Excessive animations that slow down page loading. Deduct 3 points for each redundancy found, and directly deduct 10 points if core dormitory website functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review code organization (separation of HTML/CSS/JS), proper file structure, and clean coding practices. Check for code reusability, proper commenting, and adherence to web standards. Deduct 5 points if inline styles dominate over external CSS; deduct 5 points if code duplication rate is too high (over 30%); deduct 3 points if no proper file organization exists. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface design meet professional dormitory website standards?",
      "description": "Evaluate whether the design creates a warm, welcoming dormitory atmosphere: 1) Harmonious color scheme suitable for dormitory theme (warm tones preferred) 2) Proper layout with adequate whitespace (8px grid system) 3) Readable typography (body font ≥ 14px, line height ≥ 1.5) 4) Consistent visual hierarchy. Deduct 3 points for each cluttered section, 5 points for inappropriate color choices, and 5 points for poor readability. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the user interaction smooth and responsive?",
      "description": "Judge whether interactions feel natural and responsive: 1) Hover effects and click feedback ≤ 100ms 2) Smooth transitions between sections (300-500ms duration) 3) Clear visual focus and navigation cues 4) Mobile-friendly touch interactions. Deduct 5 points for each unresponsive interaction, 3 points for jarring transitions, and 5 points if mobile usability is poor. Full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Communication",
  "difficulty": "medium"
}