{
  "index": 1597,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the generated code is executable for demonstration purposes. I also need to insert 2D product drawings, import some images, and use a sky-blue tech style background. The company name is Sichuan Yagaozhi Intelligent Equipment Co., Ltd. Please rewrite a more detailed programming solution and implementation steps.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the 2D product drawing functionality fully implemented?",
      "description": "Evaluate whether the code includes a complete 2D drawing system with capabilities for lines, curves, dimensions, and annotations. The implementation should include zoom/pan controls, grid snapping, and proper coordinate system. Score 0 if no drawing functionality exists, 5 if basic shapes are supported but without proper editing tools, and 10 if a professional-level CAD-like drawing system is implemented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the image import and manipulation functionality properly implemented?",
      "description": "Check whether the code handles various image formats (JPG, PNG, SVG), includes proper error handling for failed imports, and offers basic image manipulation (resize, crop, rotate). Verify if the implementation includes proper memory management for large images and maintains image quality. Deduct 3 points if format support is limited, 4 points if manipulation tools are missing, and 3 points if there's no error handling for imports. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the sky-blue tech style background properly implemented?",
      "description": "Assess whether the background implementation includes proper gradients or patterns that evoke a high-tech feel, with consistent sky-blue theming. Check if the background adapts to different screen sizes and resolutions without distortion. Verify if it includes subtle animations or patterns that enhance but don't distract from the main content. Deduct 5 points for static non-responsive backgrounds, 3 points for inconsistent theming, and 2 points for performance issues. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the company branding (Sichuan Yagaozhi Intelligent Equipment Co., Ltd.) properly integrated?",
      "description": "Evaluate whether the company name and branding elements are consistently applied throughout the interface. Check for proper logo placement, consistent typography, appropriate prominence without overwhelming the interface, and localization support if needed. Deduct 3 points for inconsistent branding, 4 points for poor visibility/readability, and 3 points if branding interferes with functionality. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid input data, network interruption, user operation errors, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive 3D previews generated from 2D drawings 2. AI-assisted design recommendations 3. Collaborative real-time editing capabilities). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple drawing tools that do the same thing) 2. Function modules unrelated to the core requirements (e.g., unnecessary animations or widgets) 3. Fancy effects that affect performance (e.g., excessive particle effects or transitions). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating drawing logic/UI/data management layers), unit test coverage, and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching with the sky-blue tech theme (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Multimedia Editing-Image Editing",
  "difficulty": "medium"
}