{
  "index": 653,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure that the code you generate is executable and can be demonstrated. Develop an online image compression tool where users can upload images, view the compressed file size and compression ratio, preview the compression effect in real-time, and choose from various compression level options.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the image upload functionality properly implemented?",
      "description": "Review whether the code implements file upload with proper validation for image formats (at minimum JPG, PNG, GIF), handles file size limits, and provides progress indication during upload. Check for error handling when invalid file types are selected or upload fails. Score 0 if upload functionality is missing, 5 if basic upload works but lacks validation/error handling, and 10 if fully implemented with all necessary validations and user feedback.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the image compression algorithm properly implemented with multiple options?",
      "description": "Evaluate whether the code implements various compression algorithms or compression levels (at least 3 different options). Check if it properly maintains aspect ratio, handles different color profiles, and applies proper quality reduction techniques. Deduct 5 points if only a single compression method is available, 3 points if important parameters like quality factor are not adjustable. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the tool provide real-time preview and comparison functionality?",
      "description": "Check if the application provides side-by-side comparison between original and compressed images, enables zooming into specific areas to compare details, and updates preview in real-time when compression settings change. Deduct 5 points if comparison requires page reload, 3 points if there's no zoom functionality for detail inspection, and 5 points if image switching is not seamless. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are compression metrics clearly displayed and accurate?",
      "description": "Verify if the tool accurately displays original file size, compressed file size, compression ratio, and estimated quality loss. Check if the data updates immediately when compression settings change and if values are properly formatted (KB/MB with appropriate decimal places). Deduct 5 points if calculations are inaccurate, 3 points if metrics don't update in real-time, and 5 points if critical metrics are missing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as large image files, corrupt images, browser compatibility issues, memory limitations, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Batch processing multiple images 2. Custom presets for different output purposes like social media platforms 3. Automatic suggestion of optimal compression settings 4. Image editing capabilities before compression). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple compression libraries doing the same work) 2. Function modules unrelated to image compression (e.g., unrelated social sharing features) 3. Fancy effects that affect performance (e.g., unnecessary animations slowing down the interface). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating UI/compression logic/file handling), error handling, memory management for large images, and code organization. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if WebWorkers aren't used for heavy compression tasks to prevent UI freezing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times) 4) Clear visual hierarchy between original and compressed images. Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Image preview loads within 500ms 2) Compression process shows progress indicator 3) Settings adjustments reflect in preview with minimal delay 4) Download option is clearly presented after compression. Deduct 5 points for each operation without feedback, 3 points for laggy UI during compression processing, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Multimedia Editing-Image Editing",
  "difficulty": "medium"
}