{
  "index": 1768,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the generated code is executable for demonstration. I am a student at a vocational college. My teacher requires me to introduce intrinsic semiconductors in HTML format, presented as a One Piece anime-themed game (vivid and with various images) that is humorous, funny, simple to understand. However, I don't know how to create this.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the semiconductor educational content accurate and comprehensive?",
      "description": "Review whether the code accurately explains intrinsic semiconductor concepts (band gap, electron-hole pairs, temperature dependency, etc.). Check if scientific facts are presented correctly without misconceptions. Score 0 if core semiconductor physics is absent, 5 if basic concepts are covered but lack depth, and 10 if concepts are thoroughly explained with proper technical terms and relationships.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the One Piece theme properly integrated with the educational content?",
      "description": "Evaluate how well One Piece characters, settings, and storylines are integrated with semiconductor concepts. Characters should have relevant roles that relate to semiconductor properties (e.g., Luffy as an electron, Nami as electric field). Deduct 5 points if characters are merely decorative with no conceptual connections, 3 points if the integration is superficial. Full score requires creative parallels between One Piece elements and semiconductor physics.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the implementation contain interactive elements that reinforce learning?",
      "description": "Check for interactive elements like clickable diagrams, drag-and-drop exercises, quizzes, or simulations that demonstrate semiconductor behavior. Score 0 if no interactivity exists, 5 if basic interactions (e.g., simple click revelations) are implemented, and 10 if comprehensive interactive elements that simulate semiconductor physics (e.g., temperature effects on conductivity) are included.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the humor appropriate and effectively used for educational purposes?",
      "description": "Assess whether humor enhances understanding rather than distracting from it. Humor should relate to semiconductor concepts through One Piece references (puns, situation comedy, character traits). Deduct 5 points if humor is unrelated to the educational content, 3 points if it's too complex for beginners. The full score requires humor that actually aids memory retention and comprehension of semiconductor principles.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser compatibility issues, image loading failures, interaction errors) and provide fallback mechanisms. Code with strong robustness should work across modern browsers and offer graceful degradation. Give 10 points for comprehensive error handling, 5 points for basic error management, and 0 points if errors break the experience.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the learning experience (e.g., 1. Animated electron flow visualization 2. Interactive band gap demonstration 3. Temperature-controlled semiconductor behavior). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Excessive animations that distract from learning 2. Unrelated One Piece content that doesn't connect to semiconductor concepts 3. Unnecessary technical jargon without explanation. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core educational content is overwhelmed by entertainment elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separating content/presentation/behavior), code organization, and maintainability. Deduct 5 points if global variables are overused; deduct 5 points if the code is heavily duplicated; deduct 5 points if resources are inefficiently loaded or managed. The full score is given for clean, well-structured code that follows best practices.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles while maintaining the One Piece aesthetic: 1) Balanced color scheme that enhances readability 2) Proper layout with clear visual hierarchy 3) Appropriate use of One Piece imagery that supports rather than overwhelms content. Deduct 3 points for cluttered screens, 5 points for poor readability, and 5 points for inconsistent theme application. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the animations and transitions help explain semiconductor concepts: 1) Smooth animations of electron movement 2) Clear visual feedback for user interactions 3) Appropriate pacing for educational content absorption. Deduct 5 points for jerky animations, 3 points for delayed response to user input, and 5 points for animations that obscure the educational content. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Casual",
  "difficulty": "easy"
}