{
  "index": 1022,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for display purposes. Create a homepage for an electronic product that includes product introduction, driver downloads, and after-sales service.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the product introduction section comprehensively implemented?",
      "description": "Review whether the code includes complete product showcase functionality through HTML/CSS/JavaScript, including product image carousel, detailed specifications table, feature highlights, and comparison charts. Score 0 if only basic text description is provided, 5 if product images and basic specs are included, and 10 if interactive product demos, 360-degree views, or video presentations are fully implemented with responsive design.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the driver download functionality properly structured?",
      "description": "Check whether the download section includes automatic OS detection, version compatibility checking, download progress tracking, and file integrity verification. The implementation should support categorized downloads (by product model/OS/version) with search and filter capabilities. Deduct 5 points if no automatic OS detection, 3 points if missing download progress indication, and 2 points if no file verification mechanism. Full score requires secure download links with bandwidth optimization.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the after-sales service system well-designed and functional?",
      "description": "Evaluate whether the service section includes multiple contact methods (live chat, ticket system, FAQ search), warranty status checker, and service request forms with file upload capability. Should implement real-time chat integration or callback request system. Deduct 5 points if only static contact information is provided, 3 points if missing interactive support features, and 2 points if no warranty/service status tracking functionality.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the complete navigation and information architecture constructed?",
      "description": "Check whether the code includes intuitive site navigation, breadcrumb trails, internal search functionality, and logical information hierarchy. Should implement smooth scrolling between sections, anchor links, and mobile-responsive navigation menu. Deduct 5 points if navigation structure is confusing, 3 points if missing search functionality, and 2 points if mobile navigation is poorly implemented. Give 10 points if includes advanced features like predictive search or personalized content recommendations.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as broken image links, failed downloads, network timeouts, invalid form submissions, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should include form validation, graceful degradation for unsupported browsers, and proper error handling for AJAX requests, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance user experience (e.g., 1. AR product visualization 2. AI-powered troubleshooting assistant 3. Interactive product configurator 4. Real-time system compatibility checker 5. Community forum integration). Add 3 points for each practical innovative feature implemented (maximum 10 points). Features should be functional, not just decorative.",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple contact forms with same purpose) 2. Feature bloat unrelated to electronic products (e.g., built-in games or social media feeds) 3. Excessive animations that slow down page performance (e.g., unnecessary parallax effects on every section). Deduct 3 points for each redundancy found, and directly deduct 10 points if core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating content/presentation/behavior layers), semantic HTML structure, CSS organization (using methodologies like BEM), and JavaScript best practices. Deduct 5 points if inline styles are extensively used or HTML lacks semantic structure; deduct 3 points if CSS is not organized or lacks vendor prefixes; deduct 2 points if JavaScript lacks proper event handling or memory leak prevention. The full score requires clean, maintainable code with proper documentation.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern web design principles: 1) Professional color scheme matching brand identity (consistent with tech industry standards) 2) Proper typography hierarchy (headings, body text, captions with appropriate contrast ratios ≥4.5:1) 3) Consistent spacing and grid system (following 8px baseline grid) 4) High-quality product imagery with proper optimization. Deduct 3 points for poor visual hierarchy, 5 points for accessibility issues (color contrast, font sizes), and 5 points for unprofessional or inconsistent branding. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the interactive elements conform to user experience best practices: 1) Page load time ≤ 3 seconds with progressive loading 2) Smooth transitions between sections (300-500ms duration) 3) Responsive hover states and click feedback ≤ 100ms 4) Intuitive form interactions with real-time validation 5) Mobile touch interactions optimized for finger navigation. Deduct 5 points for slow page loading, 3 points for missing interaction feedback, 3 points for poor mobile touch experience, and 2 points for jerky animations or transitions. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Business Website",
  "difficulty": "medium"
}