{
  "index": 726,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you provide is executable and can be demonstrated. I am a photography practical training instructor, and when conducting portrait photography sessions in a studio, lighting setup is a challenging aspect. I would like to design a virtual photography studio lighting scenario. Please help me design the code for this.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the virtual photography studio environment fully implemented?",
      "description": "Review whether the code accurately creates a 3D/2D virtual studio environment with proper spatial dimensions, camera positioning, and subject placement. Check if the studio can be viewed from multiple angles. Score 0 if no proper environment is created, 5 if a basic environment exists but lacks detail, and 10 if the studio environment is complete with proper scale and perspectives.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the lighting system comprehensive and realistic?",
      "description": "Evaluate whether the code implements various lighting types (key light, fill light, rim light, background light, etc.) with adjustable parameters (intensity, color temperature, softness, angle). Check if light modifiers (softboxes, umbrellas, reflectors, snoots) are implemented. Deduct 5 points if only basic lighting is available, 3 points if light modifiers are missing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the lighting effect rendering accurate and physically based?",
      "description": "Check whether the lighting effects follow physical principles, including proper shadow casting, light falloff with distance, color blending, and reflections. Verify if the code simulates the inverse-square law for light intensity. Deduct 5 points if shadows are unrealistic, 3 points if light falloff is incorrect. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the user interface for lighting manipulation intuitive and comprehensive?",
      "description": "Assess whether the interface allows users to easily add, remove, position, and adjust lighting equipment with visual feedback. Check if it includes drag-and-drop functionality, sliders for intensity/temperature controls, and visual indicators of light direction. Deduct 3 points for each essential control missing, and 5 points if the interface is confusing or unintuitive. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as extreme lighting values, browser resizing, incompatible devices, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Real-time histogram display 2. Lighting setup templates/presets 3. Before/after comparison views 4. Simulated portrait with different skin tones). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar lighting controls 2. Function modules unrelated to photography lighting 3. Fancy effects that affect performance and distract from the educational purpose. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating lighting logic/view/rendering layers), code organization, and performance optimization. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the rendering performance is poor on standard hardware. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching suitable for a photography application (neutral, non-distracting colors) 2) Proper layout spacing for lighting controls 3) Professional font system with clear labeling of lighting equipment. Deduct 3 points for each crowded visual element, 5 points for a distracting color scheme that makes light evaluation difficult, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and educational?",
      "description": "Judge whether the lighting adjustments provide immediate visual feedback and educational value: 1) Light adjustment feedback delay ≤ 100ms 2) Visual representation of how changing parameters affects the image 3) Clear indication of lighting principles in action. Deduct 5 points for each lighting adjustment without visible feedback, 3 points for laggy rendering during adjustments, and 5 points for lack of educational context in the simulation. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Simulation & Modeling-3D Simulation",
  "difficulty": "hard"
}