{
  "index": 1313,
  "question": "You are a Code Expert\n\nYou are a code expert. Please use your professional knowledge to generate accurate and professional responses. Try to ensure that any code you provide is executable.\n\nTo become excellent, a person needs to make continuous efforts and optimizations in multiple aspects. Here are some key suggestions to help a person move towards excellence every day:\n\n### 1. **Set Clear Goals**\n   - **Short-term goals**: Set specific, achievable small goals every day to maintain motivation and direction.\n   - **Long-term goals**: Clarify long-term life or career goals and develop step-by-step plans.\n\n### 2. **Efficient Time Management**\n   - **Priority ranking**: Use the \"Important-Urgent\" matrix to prioritize important and urgent tasks.\n   - **Time planning**: Create daily plans, allocate time reasonably, and avoid procrastination.\n   - **Focus and rest**: Use techniques like the \"Pomodoro Technique\" to maintain a balance between efficient work and appropriate rest.\n\n### 3. **Continuous Learning and Growth**\n   - **Reading and learning**: Spend time daily reading books, articles, or learning new skills to keep knowledge updated.\n   - **Reflection and summary**: Reflect on the day's gains and shortcomings at the end of each day, record growth points.\n   - **Learn from others**: Actively seek advice from excellent people, absorb their experience and wisdom.\n\n### 4. **Cultivate Healthy Habits**\n   - **Regular routine**: Maintain adequate sleep, go to bed early and rise early to ensure energy.\n   - **Healthy diet**: Focus on balanced nutrition, avoid excessive intake of junk food.\n   - **Consistent exercise**: Exercise appropriately every day to maintain physical and mental health.\n\n### 5. **Positive Mindset and Emotional Management**\n   - **Self-motivation**: Give yourself positive affirmation every day to maintain a positive mindset.\n   - **Emotional regulation**: Learn to manage stress and negative emotions, maintain inner peace and stability.\n   - **Gratitude and optimism**: Record things to be grateful for every day, cultivate an optimistic attitude toward life.\n\n### 6. **Social and Interpersonal Relationships**\n   - **Build quality relationships**: Associate with positive people, stay away from negative energy.\n   - **Help others**: Do some good deeds within your ability every day, cultivate altruistic spirit.\n   - **Communication and listening**: Improve communication skills, learn to listen to others' opinions and suggestions.\n\n### 7. **Focus and Deep Work**\n   - **Reduce distractions**: Stay away from phones, social media, and other distractions to focus on important tasks.\n   - **Deep thinking**: Spend time daily on deep thinking, solving complex problems, or innovating.\n\n### 8. **Continuous Improvement and Iteration**\n   - **Accept feedback**: Actively seek feedback from others to improve your shortcomings.\n   - **Courage to try**: Don't fear failure, try new things every day and accumulate experience.\n   - **Iterative optimization**: Regularly review your plans and methods, continuously optimize and adjust.\n\n### 9. **Maintain Curiosity and Creativity**\n   - **Explore the unknown**: Expose yourself to new fields or knowledge every day, maintain curiosity about the world.\n   - **Cultivate creativity**: Stimulate creativity through writing, drawing, music, and other means.\n\n### 10. **Financial and Life Management**\n   - **Financial planning**: Pay attention to your financial situation daily, make reasonable consumption and savings plans.\n   - **Simplify life**: Reduce unnecessary material needs, focus on what truly matters.\n\n### Sample Daily Schedule:\n- **Morning**: Early rise, exercise, meditation, reading or learning.\n- **Morning**: Handle important tasks, focus on work or study.\n- **Noon**: Healthy lunch, short break.\n- **Afternoon**: Continue work or study, handle secondary tasks.\n- **Evening**: Summarize the day, read or study, communicate with family and friends.\n- **Before bed**: Relax, prepare plans for the next day.\n\n### Conclusion\nExcellence is not achieved overnight but accumulated through daily small habits and continuous effort. The key lies in perseverance, self-discipline, and constantly optimizing your lifestyle. As long as you move toward your goals every day, you will eventually become a better self.\n\nI meant to create a board based on this.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the personal excellence tracking board fully implemented?",
      "description": "Review whether the code accurately implements a visual dashboard for tracking personal excellence metrics across all 10 categories mentioned (goals, time management, learning, habits, mindset, relationships, deep work, improvement, curiosity, finances). Score 0 if the board is not implemented, 5 if only basic tracking is available, and 10 if comprehensive tracking with data visualization for all categories is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the daily task management and tracking system implemented?",
      "description": "Check if the implementation includes functionality for setting daily tasks, marking completion, and visualizing progress over time. The board should include prioritization features (Important-Urgent matrix) and time planning elements. Deduct 3 points if task prioritization is missing, 4 points if progress tracking over time is absent, and 3 points if there's no visual feedback on completion. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the habit tracking and streak visualization feature implemented?",
      "description": "Evaluate whether the code provides mechanisms to define recurring habits, track streaks, and visualize consistency. Should include graphical representations for habit completion rates and streak maintenance. Deduct 4 points if streak visualization is missing, 3 points if habit categories are not customizable, and 3 points if there's no data export/backup feature. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the goal setting framework with progress tracking implemented?",
      "description": "Check if the board implements both short-term and long-term goal tracking with visual progress indicators. Should include milestone tracking, deadline management, and goal categorization. Deduct 3 points if goal hierarchy (short vs long-term) is not implemented, 4 points if progress visualization is missing, and 3 points if reminders/alerts for upcoming deadlines aren't included. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid inputs, browser storage limitations, data inconsistencies, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. AI-powered habit recommendations 2. Mood tracking correlation with productivity 3. Social accountability integrations 4. Pomodoro timer with customizable work/break periods). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar tracking metrics (e.g., multiple overlapping habit trackers) 2. Function modules unrelated to personal excellence (e.g., a built-in game) 3. Fancy effects that affect performance (e.g., excessive animations that slow loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/view/controller layers), unit test coverage, and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Management Systems-Frontend/Backend Platforms",
  "difficulty": "hard"
}