{
  "index": 731,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for display. Create a character information panel for a novel, including details such as race, age, potential, and other information (Human female who has awakened the Yan-Huang bloodline).",
  "checklist": [
    {
      "id": 0,
      "title": "Is the character information panel structure logically organized?",
      "description": "Review whether the HTML structure creates a clear visual hierarchy with proper semantic tags (section, article, header). Check if information is categorized logically (basic info, attributes, abilities, background). Score 0 if the structure is chaotic, 5 if basic organization exists but lacks semantic clarity, and 10 if information is perfectly structured with semantic HTML and logical grouping.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the character's Yan-Huang bloodline feature prominently displayed and visually distinguished?",
      "description": "Evaluate if the special bloodline feature is highlighted through visual cues (unique styling, icons, color coding) rather than just mentioned in text. The bloodline should be immediately recognizable as the character's defining trait. Deduct 5 points if the bloodline is only mentioned textually without visual emphasis, and 3 points if the visual treatment isn't distinctive enough from other attributes. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the panel include interactive elements to explore character details?",
      "description": "Check for interactive elements like expandable sections, tooltips for abilities, tabbed interfaces for different information categories, or hover effects that reveal additional lore. Score 0 if no interactivity exists, 5 if basic interactions (like simple toggles) are implemented, and 10 if rich, intuitive interactions enhance the exploration of character information.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there a visual representation of the character's attributes and potential?",
      "description": "Assess whether attributes (strength, intelligence, etc.) and potential are presented with visual charts (radar charts, progress bars, star ratings) rather than just numbers. The visualization should make attribute comparisons intuitive. Deduct 5 points if only text values are used, and 3 points if visualizations exist but are hard to interpret. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle edge cases (missing data fields, long text content, browser compatibility issues) and provides fallbacks or graceful degradation. Code with strong robustness should validate inputs and handle display issues across devices. Give 10 points for comprehensive error handling, 5 points for basic safeguards, and 0 points if the panel breaks easily.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Dynamic character portraits that change with stat modifications 2. Timeline visualization of character development 3. Animated bloodline effects). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant display of the same information 2. Unnecessary animations that don't convey meaning 3. Feature bloat unrelated to character information display. Deduct 3 points for each redundancy found, and directly deduct 10 points if core information readability is compromised by excessive elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of data and presentation logic), code reusability (component-based approach), and maintainability. Deduct 5 points if global variables are overused; deduct 5 points if styling and logic are tightly coupled without separation; deduct 5 points if the code lacks comments or documentation. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the design follows fantasy/novel UI conventions while maintaining professional standards: 1) Thematic color palette appropriate for the fantasy setting 2) Typography hierarchy with decorative elements for headers but readable body text 3) Balanced white space that creates an elegant layout. Deduct 3 points for inconsistent styling, 5 points for poor readability, and 5 points for misaligned elements. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether transitions and animations enhance the storytelling: 1) Subtle hover effects that highlight important information 2) Smooth transitions between different information sections 3) Loading states for any dynamic content. Deduct 5 points for jarring or abrupt transitions, 3 points for animations that feel disconnected from the fantasy theme, and 5 points for interactions that interrupt the narrative flow. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Management Systems-Frontend/Backend Platforms",
  "difficulty": "medium"
}