{
  "index": 1143,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you provide is executable for display. Generate code to plot inverse proportion graphs for sixth-grade elementary school mathematics.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the inverse proportion mathematical function correctly implemented?",
      "description": "Review whether the code accurately implements the inverse proportion function y = k/x (where k ≠ 0) with proper mathematical calculation logic. Check if it handles different k values correctly and includes domain restrictions (x ≠ 0). Score 0 if the mathematical formula is incorrect, 5 if only basic calculation is implemented without domain handling, and 10 if the complete inverse proportion function with all mathematical properties is accurately represented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the graph plotting functionality comprehensively implemented?",
      "description": "Evaluate whether the plotting system includes proper coordinate system setup, axis labeling, grid lines, and smooth curve rendering for hyperbola branches in both positive and negative quadrants. Check if the graph accurately represents the asymptotic behavior at x=0 and y=0. Deduct 5 points if asymptotes are not properly handled, 3 points if only one quadrant is plotted. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are interactive features suitable for sixth-grade learning implemented?",
      "description": "Check whether the code includes age-appropriate interactive elements such as parameter adjustment (changing k values), point coordinates display on hover, and clear visual feedback. Evaluate if the interface provides educational tooltips or hints about inverse proportion properties. Deduct 5 points if no interactivity is provided, 3 points if interactions are too complex for elementary students. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the educational content mathematically accurate and grade-appropriate?",
      "description": "Assess whether the implementation correctly demonstrates key inverse proportion concepts suitable for sixth-grade level: relationship between variables, hyperbola shape, and practical applications. Check if examples and explanations match curriculum standards. Deduct 5 points if mathematical concepts are too advanced, 3 points if key learning objectives are missing. Give 10 points if content perfectly aligns with sixth-grade mathematics curriculum.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as division by zero, invalid input values, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that enhance learning?",
      "description": "Check whether the code includes educational enhancements that improve learning experience (e.g., 1. Animation showing how the curve changes with different k values 2. Real-world problem examples with inverse proportion 3. Interactive quizzes or exercises). Add 3 points for each practical educational feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar plotting functions (e.g., multiple graphing libraries coexisting) 2. Function modules unrelated to mathematics education (e.g., social media sharing buttons) 3. Overly complex features inappropriate for sixth-grade level (e.g., advanced calculus annotations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core educational functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating math calculation/visualization/interaction layers), code organization, and maintainability. Deduct 5 points if global state pollution is found or no clear code structure exists; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the code lacks proper documentation for educational use. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface design meet educational and professional standards?",
      "description": "Evaluate whether the visual design follows educational interface principles: 1) Age-appropriate color scheme (bright but not distracting) 2) Clear mathematical notation and readable fonts (≥ 16px for better readability) 3) Intuitive layout with proper visual hierarchy for learning materials. Deduct 3 points for each confusing visual element, 5 points for color combinations that strain young eyes, and 5 points for unclear mathematical symbols or labels. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Are the dynamic interactions smooth and educationally effective?",
      "description": "Judge whether the interactive elements enhance learning experience: 1) Immediate visual feedback when parameters change (≤ 200ms response time) 2) Smooth graph transitions that help students understand mathematical relationships 3) Clear visual cues for interactive elements. Deduct 5 points for each unresponsive interaction, 3 points for confusing transition effects, and 5 points for hidden or unclear interactive controls. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "easy"
}