{
  "index": 1206,
  "question": "You are a code expert, please use your professional knowledge to generate accurate and professional responses. Make sure that the generated code can be executed for demonstration purposes. Please design a DuPont analysis chart for this enterprise, with the DuPont chart in HTML format.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the DuPont analysis structure correctly implemented?",
      "description": "Verify that the chart includes the three main components of DuPont analysis: Return on Equity (ROE), Return on Assets (ROA), and Financial Leverage. Check if the decomposition logic is accurate (ROE = Net Profit Margin × Asset Turnover × Equity Multiplier). Deduct 5 points if any main component is missing, deduct 3 points if the calculation relationships are incorrect. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the financial metrics and ratios calculated correctly?",
      "description": "Examine whether all financial metrics (such as Net Profit Margin, Asset Turnover, Equity Multiplier) are correctly calculated and displayed with appropriate formulas. Check for mathematical accuracy in ratio calculations. Deduct 5 points for each incorrectly calculated major ratio, 3 points for minor calculation errors. Give 10 points if all calculations are accurate and properly documented.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the hierarchical structure of the DuPont chart properly visualized?",
      "description": "Evaluate if the chart clearly shows the hierarchical breakdown of ROE into its components and sub-components. The visualization should demonstrate the parent-child relationships between financial metrics. Deduct 5 points if the hierarchy is flat or confusing, 3 points if some relationships are unclear. Full implementation with clear hierarchical visualization earns 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the implementation allow for data input or modification?",
      "description": "Check if the chart provides functionality for users to input or modify financial data, with the chart updating accordingly. Deduct 5 points if data cannot be modified at all, 3 points if only basic modification is supported without validation. Award 10 points for a complete implementation with data validation and real-time updates.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid inputs, missing data, division by zero, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Comparative analysis with industry benchmarks 2. Historical trend visualization 3. Interactive tooltips with explanations of financial metrics). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple calculation methods for the same ratio) 2. Function modules unrelated to DuPont analysis (e.g., irrelevant financial calculators) 3. Fancy effects that affect performance (e.g., unnecessary animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating calculation logic/visualization/user interaction layers), code reusability, and maintainability. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there's no clear separation of concerns. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the DuPont chart follows professional financial visualization standards: 1) Clean and professional color scheme appropriate for financial data 2) Proper spacing between chart elements 3) Professional typography with consistent font hierarchy (headings vs. data). Deduct 3 points for each visual clutter issue, 5 points for inappropriate color choices, and 5 points for poor text formatting. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and informative?",
      "description": "Judge whether the chart provides meaningful interactive elements: 1) Hover tooltips with detailed metric explanations 2) Smooth transitions when data changes 3) Clear visual indication of calculation flow. Deduct 5 points for static charts with no interactivity, 3 points for interactions that don't enhance understanding, and 5 points for confusing or non-intuitive interactions. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "easy"
}