{
  "index": 1667,
  "question": "You are a coding expert. Please use your professional knowledge to generate accurate and professional responses. Make sure that the code you generate is executable and can be demonstrated. Create a 3D map of China showing city outlines, where the height of each city's outline represents the sales volume of new energy vehicles in that city.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the 3D map of China correctly implemented?",
      "description": "Examine whether the code accurately renders China's geographical boundaries with appropriate GeoJSON data, including provincial and city outlines. Check if the map projection is appropriate (preferably a conformal projection like Mercator or Albers for China). Deduct 5 points if provincial boundaries are missing, 3 points if city boundaries are inaccurate, and 5 points if the projection distorts China's shape significantly. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the 3D extrusion of city outlines correctly implemented based on sales data?",
      "description": "Verify that each city's outline is extruded in 3D space proportionally to its new energy vehicle sales data. Check if the height mapping function is appropriate (linear, logarithmic, etc.) given the potential large variance in sales volumes across cities. Deduct 5 points if the height calculation is incorrect, 3 points if there's no normalization for extreme values, and 5 points if the extrusion method creates visual artifacts. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the data visualization accompanied by appropriate legends and annotations?",
      "description": "Evaluate whether the visualization includes clear legends explaining the height-to-sales mapping, city labels for at least major cities, and annotations that help interpret the data. Check for a color scale or height scale indicator. Deduct 3 points for missing legends, 3 points for absent city labels, and 4 points if there's no way to determine actual sales figures from the visualization. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there interactivity allowing users to explore the data?",
      "description": "Assess the implementation of interactive features such as zooming, panning, rotating the 3D view, hovering for city information tooltips, and clicking for detailed sales data. Deduct 2 points for each missing core interaction (zoom/pan/rotate), 3 points for missing tooltips, and 3 points if there's no way to view specific sales figures. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing data, browser compatibility issues, mobile responsiveness, etc.) and provide graceful fallbacks or error handling. Code with strong robustness should load fallback data if the main dataset fails, handle WebGL/3D rendering limitations, and adapt to different screen sizes. Give 10 points for comprehensive error handling, 5 points for basic error checks, and 0 points if errors crash the application.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Time-series animation showing sales growth 2. Comparative visualization with traditional vehicle sales 3. Weather or environmental overlay showing correlation with EV adoption). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant data processing methods 2. Visualization elements unrelated to the city sales data (e.g., unnecessary decorative elements) 3. Heavy effects that affect performance (e.g., excessive particle systems or shaders). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core visualization is obscured by redundant elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data processing/visualization/interaction layers), code reusability, and performance optimization. Deduct 5 points if global namespace pollution is found; deduct 3 points if the code doesn't implement proper asset loading strategies for large GeoJSON files; deduct 5 points if there's no optimization for the 3D rendering performance. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern data visualization principles: 1) Appropriate color scheme that aids data interpretation (not just aesthetics) 2) Clear visual hierarchy distinguishing map, data, and controls 3) Professional typography with readable labels even on complex 3D terrain. Deduct 3 points for poor color choices that hinder data interpretation, 5 points for cluttered interface elements, and 5 points for illegible labels or legends. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and responsive?",
      "description": "Judge whether the 3D visualization performs well: 1) Smooth rotation/zoom with frame rate ≥30fps 2) Responsive tooltips appearing within 100ms of hover 3) Efficient rendering that handles all city polygons without significant lag. Deduct 5 points for jittery camera movements, 3 points for delayed data loading affecting interactivity, and 5 points if the visualization becomes unresponsive with full data. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "medium"
}