{
  "index": 339,
  "question": "You are a code expert, please use your professional knowledge to generate accurate and professional responses. Make sure the generated code is executable for demonstration. Create a comprehensive dashboard for the economic and environmental benefits of embroidery products (in economic benefits, achieve 30% growth in overseas market sales by 2025, help intangible cultural heritage inheritors increase order volume by 20%, and raise average order value from $200 to $800). Requirements include visualization design and detailed data presentation. Please output in HTML format to ensure it's executable.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the dashboard visualization for economic benefits fully implemented?",
      "description": "Review whether the code accurately implements charts/graphs showing economic metrics (30% growth in overseas market, 20% increase in order volume, and average order value increase from $200 to $800). Verify if the visualization includes trend analysis, comparative views, and forecasting elements.Score 0 if economic visualizations are missing, 5 points if basic charts are implemented without interactivity, and 10 points if comprehensive interactive visualizations with forecasting capabilities through 2025 are included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the environmental benefits visualization component properly implemented?",
      "description": "Evaluate whether the code implements visualizations for environmental impact metrics related to embroidery products (such as sustainable materials usage, carbon footprint reduction, water conservation, etc.). Check if the environmental data is properly contextualized with industry benchmarks.Score 0 if environmental visualizations are absent, 5 points if basic environmental metrics are shown without context, and 10 points if comprehensive environmental impact analysis with comparative industry benchmarks is included.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the intangible cultural heritage data presentation component implemented?",
      "description": "Check whether the dashboard includes specific visualizations for intangible cultural heritage inheritors' data (number of artisans, geographical distribution, skill categories, etc.) and how their order volumes have changed. Verify if the visualization connects cultural preservation with economic outcomes.Score 0 if cultural heritage data is missing, 5 points if basic inheritor data is shown without economic correlation, and 10 points if comprehensive visualization of cultural-economic relationships is implemented.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the overseas market analysis component properly implemented?",
      "description": "Assess whether the code implements geographical market visualization showing the 30% growth target in overseas markets. Check if the visualization includes market segmentation, regional performance comparison, and growth trajectory toward the 2025 goal.Score 0 if overseas market visualization is missing, 5 points if basic geographical data is presented without growth projections, and 10 points if comprehensive market analysis with interactive geographic elements and clear growth pathways is included.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing data, browser compatibility issues, responsive design requirements, etc.) and provide friendly error prompts or recovery mechanisms.Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. AI-driven market prediction model 2. Interactive embroidery pattern explorer tied to sales data 3. Virtual tour of artisan workshops with economic impact indicators).Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar visualizations (e.g., multiple charts showing the same data differently) 2. Function modules unrelated to embroidery economics/environmental impact (e.g., general textile industry data) 3. Fancy effects that affect performance (e.g., unnecessary 3D effects or animations).Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data processing/visualization/interaction layers), code reusability for different chart types, and implementation of design patterns.Deduct 5 points if global variable pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the visualization library implementation is inconsistent. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the dashboard design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors with appropriate accent colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times) 4) Clear visual hierarchy between economic and environmental data sections.Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic chart-text layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dashboard interactions conform to human perception characteristics: 1) Filter/selection feedback delay ≤ 100ms 2) Chart transition animation duration controlled between 300-500ms 3) Clear visual focus guidance between economic and environmental sections. 4) Intuitive drill-down capabilities from summary to detailed data views.Deduct 5 points for each interaction without feedback, 3 points for visual lag during data filtering/sorting, and 5 points for hard-to-find key data comparison functions. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "medium"
}