{
  "index": 442,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate, professional responses. Make sure the generated code is executable for demonstration. Please quickly check the uploaded data. Draw a monthly trend chart of electricity sales and electricity prices. Present the analysis results in chart form and generate an HTML format file.\n\nRequirements: Generate HTML format results, ensure the code complies with W3C standards, with no errors or compatibility issues. Strictly verify the code, promptly correct error messages, and ensure the website's stability and accessibility.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the data loading and parsing functionality properly implemented?",
      "description": "Check if the code correctly loads the uploaded data, handles various formats (CSV, Excel, JSON), and properly parses numeric values for electricity sales and prices. Score 0 if data loading is missing, 5 if basic loading exists but with format limitations, 10 if robust parsing with error handling is implemented.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the monthly trend chart for electricity sales and prices accurately visualized?",
      "description": "Evaluate whether the visualization correctly displays both electricity sales and price trends over months, with proper axes, scales, and data mapping. Check for dual Y-axes or appropriate normalization methods for displaying different units. Deduct 5 points if only one metric is shown, 3 points if scales are inappropriate for data ranges. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are appropriate chart types and visualization libraries utilized?",
      "description": "Assess the choice of visualization library (D3.js, Chart.js, Highcharts, etc.) and chart type (line, area, combo) for representing time-series data. The implementation should leverage the library's features for responsive design and interactivity. Deduct 5 points for inappropriate chart type selection, 3 points for missing legend or inadequate labeling. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there adequate data analysis functionality included?",
      "description": "Check if the code incorporates analysis features such as trend identification, correlation calculation between sales and prices, moving averages, or highlighting significant changes. Deduct 5 points if only raw data is displayed without any analysis, 3 points if analysis is superficial. Full score requires meaningful insights extraction from the data. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing data points, invalid data formats, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive tooltips with additional metrics 2. Data filtering/zooming capabilities 3. Predictive trend lines or forecasting). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar charting functions 2. Excessive visualization elements unrelated to electricity data analysis 3. Fancy effects that affect performance (e.g., unnecessary animations or transitions). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data processing/visualization/UI components), code organization, and adherence to W3C standards. Deduct 5 points if global namespace pollution is found; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there are W3C validation errors. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the chart design follows modern data visualization principles: 1) Harmonious color palette that distinguishes data series 2) Proper chart proportions and axis scales 3) Professional typography for labels and legends (readable font sizes, consistent styling). Deduct 3 points for poor color choices that hinder data interpretation, 5 points for misleading visual representations, and 5 points for cluttered axes or legends. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and responsive?",
      "description": "Judge whether the chart provides appropriate interactive features: 1) Responsive design that adapts to different screen sizes 2) Smooth transitions when hovering or filtering data 3) Accessible interaction methods (keyboard navigation, screen reader support). Deduct 5 points for non-responsive design, 3 points for jarring transitions or delayed rendering, and 5 points for inaccessible interaction patterns. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "easy"
}