{
  "index": 968,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable. Create a comprehensive data dashboard for the retail consumer credit industry that includes visualization design and data presentation. Output in HTML format and ensure the file is executable.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the retail credit data visualization dashboard complete with basic components?",
      "description": "Check whether the HTML includes the essential dashboard components (header, sidebar/navigation, main visualization area, filters section). Assess the inclusion of relevant retail credit metrics (e.g., credit scores, loan approval rates, delinquency rates, debt-to-income ratios). Score 0 if critical components are missing, 5 if basic structure exists but lacks key metrics, and 10 if comprehensively designed with all essential retail credit KPIs.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are appropriate visualization charts implemented for retail credit data?",
      "description": "Evaluate the types of charts used (line charts for trends over time, bar charts for comparisons, pie/donut charts for distributions, heatmaps for correlations, etc.). Check for retail credit-specific visualizations such as risk matrices, loan performance waterfalls, or vintage analysis charts. Deduct 3 points for each inappropriate chart type, 5 points if chart selection doesn't match the data nature. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the data filtering and interactivity system well-designed?",
      "description": "Evaluate whether the dashboard includes interactive features like time period selectors, demographic filters, loan type filters, and risk category selectors. Check if interactions between filters and visualizations work properly with immediate visual feedback. Deduct 5 points if filters don't affect displayed data, 3 points if interactivity has noticeable delays. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there a well-implemented data drill-down mechanism?",
      "description": "Assess whether users can click on dashboard elements to reveal deeper insights (e.g., clicking on a delinquent segment shows individual loan details, clicking on a geographic region reveals branch-level performance). Check for breadcrumb navigation when drilling down. Deduct 5 points if drill-down functionality is missing, 3 points if navigation between levels is confusing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code handles common abnormal situations (such as empty datasets, loading errors, invalid filter combinations, etc.) and provides friendly error messages or fallbacks. Check for data validation, null checking, and exception handling. Code with strong robustness should effectively handle edge cases, giving 10 points. If robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the dashboard includes surprise features that enhance the experience (e.g., 1. AI-driven risk predictions 2. Customizable dashboard layouts 3. Anomaly detection with alerts 4. Benchmark comparisons with industry standards). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Duplicate visualizations showing the same data in different ways 2. Unnecessary metrics unrelated to retail credit (e.g., manufacturing KPIs) 3. Excessive animations or visual effects that distract from data comprehension. Deduct 3 points for each redundancy found, and directly deduct 10 points if core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of data fetching, processing, and visualization), proper use of libraries (D3.js, Chart.js, etc.), code organization, and responsive design implementation. Deduct 5 points if global variables are overused; deduct 5 points if the code is not modular; deduct 5 points if the dashboard doesn't adapt to different screen sizes. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the dashboard follows financial/retail industry visual standards: 1) Professional color scheme appropriate for financial data (avoid excessive bright colors) 2) Clean layout with logical grouping of related metrics 3) Consistent typography with proper hierarchy (headers vs. detail text). Deduct 3 points for cluttered layouts, 5 points for unprofessional color schemes, and 5 points for inconsistent design patterns. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dashboard performance optimized for large datasets?",
      "description": "Judge whether the dashboard can handle retail credit datasets efficiently: 1) Initial load time under 3 seconds 2) Smooth interactions when filtering large datasets 3) Efficient data processing with pagination or virtualization for large tables. Deduct 5 points if visualizations freeze when changing filters, 3 points for noticeable rendering delays, and 5 points if memory usage grows excessively with larger datasets. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "medium"
}