{
  "index": 976,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for display. Create a line chart showing the risk of job displacement for the Public Administration major under the impact of digital transformation. Output in HTML format and ensure it is executable.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the data structure and content of the job displacement risk chart scientifically reasonable?",
      "description": "Review whether the code includes realistic and reasonable data points for Public Administration job displacement risk under digital transformation. The data should cover multiple time periods (at least 5-10 years), include multiple risk dimensions (automation risk, skill gap, digital adaptation rate, etc.), and have logical data trends. Score 0 if using random or unrealistic data, 5 if basic trend data is provided but lacks depth, and 10 if comprehensive multi-dimensional risk data with proper scientific basis is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the line chart visualization technically complete and accurate?",
      "description": "Check whether the HTML/JavaScript implementation correctly renders a professional line chart with proper axes, labels, legends, and data plotting. Must include responsive design, proper scaling, grid lines, data point markers, and tooltip functionality. Deduct 5 points if missing essential chart elements (axes labels, legend), 3 points if data plotting is inaccurate, and 3 points if the chart is not responsive. Full score requires complete technical implementation.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Are interactive features and data exploration capabilities properly implemented?",
      "description": "Evaluate whether the chart includes meaningful interactive features such as hover effects showing detailed risk values, clickable legend filtering, zoom functionality, or time period selection. The interactions should enhance data understanding rather than being decorative. Deduct 5 points if no interactive features exist, 3 points if interactions are buggy or unresponsive, and 2 points if interactions don't provide meaningful data insights. Full score for smooth, purposeful interactivity.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is contextual information and analytical depth adequately provided?",
      "description": "Check whether the visualization includes proper context such as data sources, methodology explanation, risk factor definitions, and analytical insights about Public Administration digital transformation impact. Should include annotations for significant trend changes or key inflection points. Deduct 5 points if no contextual information is provided, 3 points if explanations are superficial, and 2 points if missing data source attribution. Full score requires comprehensive analytical context.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing data points, browser compatibility issues, rendering errors, invalid data inputs, etc.) and provide friendly error handling or fallback mechanisms. Code with strong robustness should gracefully handle edge cases and provide clear error messages. Give 10 points if fully robust, 5 points if average robustness, and 0 points if no error handling exists.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the data visualization experience (e.g., 1. Comparative overlay with other majors 2. Predictive trend modeling 3. Risk factor breakdown animations 4. Export functionality for reports). Add 3 points for each practical innovative feature implemented (maximum 10 points). Features must be functional and add real value to the analysis.",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar visualization functions (e.g., multiple chart libraries coexisting) 2. Function modules unrelated to risk analysis (e.g., built-in games or music) 3. Excessive decorative effects that distract from data insights (e.g., spinning animations, flashy transitions). Deduct 3 points for each redundancy found, and directly deduct 10 points if core data visualization is compromised by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separating data processing/visualization/interaction layers), code organization, commenting quality, and maintainability. Deduct 5 points if global namespace pollution is found or no clear code structure exists; deduct 3 points if code lacks proper comments or documentation; deduct 5 points if the code is not modular or reusable. Full score requires clean, well-organized, professional code structure.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface design meet professional data visualization standards?",
      "description": "Evaluate whether the design follows data visualization best practices: 1) Professional color scheme suitable for data representation (avoiding misleading colors) 2) Proper typography hierarchy and readability (chart title, axis labels, legends clearly distinguishable) 3) Appropriate spacing and layout following design principles 4) Accessibility considerations. Deduct 3 points for poor color choices that hinder data interpretation, 5 points for illegible text or poor typography, and 5 points for cluttered or unprofessional layout.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the data visualization interaction smooth and intuitive?",
      "description": "Judge whether the interactive elements provide immediate and clear feedback: 1) Hover effects respond within 100ms 2) Smooth transitions that aid data comprehension (200-400ms duration) 3) Clear visual hierarchy and focus management 4) Intuitive navigation and data exploration flow. Deduct 5 points for each interaction without proper feedback, 3 points for jarring or slow animations, and 5 points for confusing or non-intuitive user interface elements.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "easy"
}