{
  "index": 441,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable for display.\n\n1. Data Resourceization: Building a Trustworthy Data Foundation\nChina Unicom transforms raw data into high-value resource pools through \"governance + technology\" dual drivers:\n\nGovernance System Upgrade:\n• Implemented metadata-driven governance covering 12 core data categories including 5G network logs and industrial equipment data, establishing a three-dimensional tagging system (classification, quality, security) with 97.3% data lineage traceability.\n• Deployed \"Unicom Chain\" blockchain platform, processing 150,000+ daily data transaction certifications, improving audit efficiency by 60% and ensuring trustworthiness throughout the data lifecycle.\n\nResource Integration Innovation:\n• Created a \"lake-warehouse integration\" architecture, consolidating enterprise customer data (5TB+ daily increase) with data streams from 20+ industrial sectors and 5G factory equipment, reducing storage costs by 35%.\n• Built provincial-park two-tier edge computing network, compressing industrial data collection latency to ≤50ms, supporting concurrent real-time processing of 2000+ devices.\n\n2. Data Productization: Creating Scenario-Based Service Matrix\nConverting data resources into tradable products through \"technology + ecosystem\" integration:\n\nStandardized Product Output:\n• Developed 300+ data API interfaces, providing industry databases, analytical reports and solutions (such as the smart healthcare \"Metascape Model\" and industrial internet AI energy consumption prediction model).\n• Launched \"155SN\" digital capability system, including Unicom Cloud infrastructure, five middle platforms and N scenario-based applications supporting capability reuse.\n\nDeep Industry Integration:\n• Implemented 20,000+ \"5G + Industrial Internet\" projects across 41 industrial categories, helping 6000+ factories reduce costs and increase efficiency.\n• Built \"Five Unified\" capability system in smart cities, enabling holographic data perception and intelligent decision-making.\n\n3. Data Assetization: Achieving Value Quantification Management\nPromoting transformation of data resources into assets through \"rights confirmation + valuation\" system:\n\nAccounting Innovation:\n• Incorporated data resources (industry databases, models, etc.) into development expenditure, with data resource book value reaching 84.7639 million yuan in H1 2024, a 28% increase from 2023.\n• Explored fair value assessment models for data assets, establishing multi-dimensional value measurement systems integrated with blockchain certification.\n\nManagement System Improvement:\n• Formulated \"Data Asset Classification and Coding Standards,\" clarifying data ownership rules and completing registration of 200+ core data assets.\n• Implemented \"Mokong\" security operations platform to achieve full-chain risk monitoring of data assets, ensuring asset security.\n\n4. Data Capitalization: Unleashing Financial Leverage\nActivating data asset liquidity through \"finance + ecosystem\" innovation:\n\nSecuritization Exploration:\n• Piloted data income rights pledge financing, issuing the first 500 million yuan asset-backed security in 2024 based on industrial internet platform data traffic.\n• Co-established data element joint venture platforms with strategic investors (like Tencent and Alibaba) to promote data equity operations.\n\nCapital Operation Synergy:\n• Maintained double-digit growth in R&D investment for 8 consecutive years (up 23% year-on-year in H1 2024), developing high-value technological achievements like computing power smart networks to attract strategic capital.\n• Enhanced capital market recognition of data value premium through dividend policy optimization (2024 interim dividend up 20.5% year-on-year).\n\nBased on the above text, please generate a chart showing China Unicom's four-stage data resource value transformation in HTML format.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the four-stage data resource value transformation architecture correctly visualized?",
      "description": "Check whether the visualization clearly illustrates the four stages (Data Resourceization, Data Productization, Data Assetization, Data Capitalization) as a coherent transformation flow. Each stage should be visually distinct yet connected, showing progression. Verify that the hierarchical relationship between stages is properly communicated. Score 0 if stages are missing or incorrectly ordered, 5 if basic stages are shown but relationships are unclear, and 10 if the complete transformation journey is well articulated with clear connections.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the key components and sub-elements of each stage accurately represented?",
      "description": "Evaluate whether each stage contains its essential components: Resourceization (Governance System, Resource Integration), Productization (Standardized Products, Industry Integration), Assetization (Accounting Innovation, Management System), and Capitalization (Securitization, Capital Operation). Check if each component shows its respective sub-elements with quantitative metrics where applicable (e.g., 97.3% data lineage traceability, 84.7639 million yuan book value). Deduct 2 points for each major component missing and 1 point for missing key metrics. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the visualization incorporate the dual-driver mechanisms for each stage?",
      "description": "Review whether the chart effectively shows the dual drivers for each stage: 'governance + technology' for Resourceization, 'technology + ecosystem' for Productization, 'rights confirmation + valuation' for Assetization, and 'finance + ecosystem' for Capitalization. Deduct 2.5 points for each missing dual-driver mechanism. Each driver should be visually connected to its respective outcomes or implementations. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the progression of value creation effectively communicated?",
      "description": "Assess whether the visualization demonstrates the incremental value creation across stages - from raw data to resources to products to assets to capital returns. Value indicators should be included (cost reduction metrics, growth percentages, financial figures). The chart should convey how each stage builds upon the previous one to create higher forms of value. Deduct 3 points if value progression is unclear, 5 points if value metrics are absent, and 7 points if the visualization fails to show the relationship between stages in value creation. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common display scenarios (different screen sizes, browsers) and includes fallbacks for unsupported features. Check if the visualization remains functional and readable on mobile devices through responsive design. Deduct 3 points if the chart breaks on smaller screens, 2 points if text becomes illegible at certain viewport sizes, and 5 points if browser compatibility issues exist for major browsers. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive elements showing detailed metrics on hover/click 2. Animation effects visualizing the transformation flow 3. Toggleable views to focus on different aspects of the framework). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant visual elements that don't add informational value 2. Excessive decoration that distracts from the core data transformation concept 3. Animated effects that slow rendering or impede comprehension. Deduct 3 points for each redundancy found, and directly deduct 10 points if core information is obscured by unnecessary elements.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of data, styling, and interaction logic), code reusability, and optimization techniques. Check if the code uses appropriate HTML semantic elements, CSS best practices, and JavaScript performance patterns. Deduct 3 points for global scope pollution, 3 points for excessive inline styles, 2 points for unmaintainable code structure, and 2 points for lack of comments on complex logic. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern data visualization principles: 1) Harmonious color scheme appropriate for corporate/business context 2) Proper information hierarchy with clear visual distinction between levels 3) Professional typography system with appropriate font sizes for headings and data points. Deduct 3 points for clashing colors, 3 points for poor layout balance, and 4 points for unclear visual hierarchy. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether any interactive elements function naturally: 1) Immediate visual feedback for user actions 2) Smooth transitions between states (300-500ms duration) 3) Clear affordances indicating interactive elements. Check if interactions enhance understanding rather than complicate it. Deduct 3 points for laggy animations, 3 points for confusing interaction patterns, and 4 points for interactions that don't meaningfully improve data comprehension. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "easy"
}