{
  "index": 1426,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable when possible. Write an HTML file that draws a Gantt chart depicting the rise and fall of world empires spanning across Europe, Asia, and Africa.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the Gantt chart visualization fully implemented?",
      "description": "Review whether the HTML file correctly implements a Gantt chart structure with proper timeline representation of empires. Check if it includes time scales, empire names, and duration bars. Score 0 if visualization is missing, 5 if basic chart is implemented but lacks detail, and 10 if the chart clearly depicts multiple empires with accurate time periods.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are historical empires of Europe, Asia, and Africa accurately represented?",
      "description": "Evaluate the historical accuracy and comprehensiveness of the empires included. The visualization should include major empires from all three continents (at least 5 from each continent) with reasonably accurate time periods. Deduct 2 points for each continent underrepresented (fewer than 5 empires), and 5 points if historical dates have significant inaccuracies (>50 years for ancient empires, >20 years for more recent ones).",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the timeline implementation effective and well-scaled?",
      "description": "Check if the timeline handles the vast historical span appropriately (potentially covering 3000+ years). Assess if the scale is consistent, if important historical periods are highlighted, and if overlapping empires are clearly distinguished. Deduct 5 points if the timeline scale is distorted or inconsistent, and 3 points if overlapping empires are difficult to distinguish.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Does the visualization include interactive features for better understanding?",
      "description": "Evaluate implementation of interactive features such as zooming, panning, filtering by region/period, tooltips with additional information, or highlighting related empires. Award 2 points for each well-implemented interactive feature (max 10 points), with particular attention to features that enhance historical understanding and exploration.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser compatibility issues, missing data handling, responsive design for different screen sizes, etc.) and provide fallback mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Visual representation of empire expansion/contraction 2. Integration of important historical events as markers 3. Comparative visualization of empire territories/population/influence). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar visualization functions 2. Feature modules unrelated to historical empires visualization 3. Fancy effects that affect performance without adding historical context. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core visualization functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/visualization/interaction layers), code organization, and optimization techniques. Deduct 5 points if global state pollution is found or if appropriate design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the visualization performance is poor with noticeable lag. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern data visualization principles: 1) Clear visual hierarchy with appropriate emphasis on important empires 2) Harmonious color coding system that helps distinguish between regions/continents 3) Professional typography with readable labels (even for small empires). Deduct 3 points for each cluttered visual element, 5 points for poor color scheme that makes empire distinction difficult, and 5 points for illegible labels. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects enhance historical understanding: 1) Smooth transitions when filtering/sorting empires 2) Responsive tooltips appearing within 100ms 3) Clear visual cues for interactive elements. Deduct 5 points for jerky animations, 3 points for delayed responses to user interactions, and 5 points for confusing or hidden interactive controls. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Data Science-Data Visualization Dashboards",
  "difficulty": "medium"
}