{
  "index": 1670,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for display. Please provide a lightweight solution for a marriage compatibility calculator mini-program based on the Chinese BaZi (Eight Characters) system for matchmaking agencies or fortune-telling services. Include core functionalities, technical implementation paths, and commercialization suggestions, along with open-source program code that can be quickly implemented even with zero coding background.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the BaZi calculation engine correctly implemented?",
      "description": "Evaluate whether the code accurately implements the Chinese lunar calendar conversion and BaZi (Eight Characters) derivation, including the calculation of year, month, day, and hour pillars. Check if the code handles special cases like leap months and date boundary conditions. Score 0 if the core calculation is incorrect, 5 if basic calculations are implemented but with minor errors, and 10 if all calculations including Stems and Branches are accurately implemented with proper documentation.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the compatibility matching algorithm comprehensively developed?",
      "description": "Assess whether the code includes a complete compatibility analysis system that considers the Five Elements relationships, Ten Gods theory, and clash/harmony combinations between the couples' BaZi charts. Check if the algorithm calculates both major compatibility indicators (e.g., day master relationships) and minor influences. Deduct 5 points if only basic Yin-Yang balance is considered, and 3 points if the detailed scoring system lacks weighted factors. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the user input system user-friendly and error-tolerant?",
      "description": "Review whether the birth date and time input system supports multiple formats (Gregorian/Lunar calendar), handles timezone differences, and provides clear guidance for accurate information collection. Check if validation is implemented to prevent impossible dates or nonsensical inputs. Deduct 5 points if validation is missing, 3 points if the interface doesn't support both calendar systems, and 2 points if time selection is imprecise or confusing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the compatibility result presentation clear and customizable?",
      "description": "Evaluate whether the results display includes visual elements (charts, symbols, or color-coding), clear textual explanation of compatibility scores, and actionable insights. Check if the system allows for different levels of detail based on user preferences or business needs. Deduct 5 points if visual representation is missing, 3 points if explanations are vague or generic, and 2 points if there's no customization option. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid dates, partial information, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Visualization of five elements balance 2. Compatibility trends across time 3. Integration with social sharing). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple calendar conversion methods coexisting) 2. Function modules unrelated to BaZi compatibility (e.g., extensive horoscope readings) 3. Fancy effects that affect performance (e.g., unnecessary animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating calculation logic/view/data layers), maintainability, and simplified deployment process. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the deployment process requires advanced technical knowledge. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (traditional Chinese colors with appropriate contrast) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the commercial viability addressed comprehensively?",
      "description": "Judge whether the solution includes practical monetization strategies, scalability considerations, and market positioning for matchmaking agencies or fortune-telling services. Check if there are tiered service options, data privacy protections, and customization possibilities for business clients. Deduct 5 points if monetization strategy is missing, 3 points if scalability isn't addressed, and 2 points if there's no consideration for white-labeling or business customization. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Utility Tools-Calculation Tools",
  "difficulty": "hard"
}