{
  "index": 502,
  "question": "You are a code expert, please use your professional knowledge to generate accurate and professional replies. Make sure the generated code is executable for demonstration. ======== Role ========\nYou are an experienced code expert. You are provided with a software development requirement description and asked to generate project code based on these requirements. Strictly follow the rules to help users generate complete project code with simple, easy-to-understand comments. Don't output anything else.\n\n======== Output Rules ========\n1. You should always generate complete, runnable project code. Please ensure the project is fully executable\n2. Ensure all code files you output are complete, don't omit any code\n3. Before final output, carefully review and check all code to evaluate its executability. If the code cannot run or contains errors, regenerate it\n4. If the requirements involve external API access or user data (images, videos, audio, etc.), please provide mock data\n\n======== Project Requirements ========\nImplement an online audio loop editing tool where users can upload audio files, select start and end points, set the selected portion as a loop segment, and export it as a new file.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the audio file upload functionality fully implemented?",
      "description": "Check whether the code implements a complete audio file upload mechanism including: file type validation (must support at least MP3, WAV, OGG formats), file size limitations with appropriate user feedback, and proper error handling for upload failures. Examine if the uploaded files are properly stored (either temporarily or persistently) and if the interface provides clear visual feedback during the upload process.0 points if upload functionality is missing, 5 points if basic upload exists but lacks validation or feedback, 10 points if upload functionality is complete with all necessary validations and user feedback.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the audio playback and visualization system properly implemented?",
      "description": "Evaluate whether the code includes a functional audio player component with standard controls (play/pause, volume) and a waveform visualization that accurately represents the uploaded audio. The waveform should be properly scaled and render correctly for different audio durations. Check if the playback position is visually indicated on the waveform and if the system handles different audio formats consistently.0 points if playback or visualization is missing, 5 points if basic playback exists but visualization is inadequate, 10 points for complete implementation with responsive waveform visualization that accurately represents the audio data.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the loop selection functionality properly implemented?",
      "description": "Assess whether users can intuitively select start and end points for loops either through visual markers on the waveform or through timestamp inputs. Check if the selection mechanism includes features like draggable handles, snap-to-beat functionality, or precise time input fields. Verify that the selected loop region is visually highlighted and that the system prevents invalid selections (end before start).0 points if loop selection is missing, 5 points if basic selection exists but lacks precision controls, 10 points for comprehensive selection tools with multiple input methods and validation.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the loop playback and export functionality complete?",
      "description": "Examine whether the system can properly play the selected loop segment repeatedly with smooth transitions between iterations. Check if the export functionality allows users to save the loop as a new audio file in common formats (MP3, WAV). Verify if export options like quality settings, fade in/out options, or normalization are available and if the system provides progress feedback during export processing.0 points if loop playback or export is missing, 5 points if basic functionality exists but lacks options or smooth transitions, 10 points for seamless loop playback and comprehensive export options.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as corrupted audio files, browser compatibility issues, memory constraints with large files) and provide friendly error prompts or recovery mechanisms. Check if the application implements proper exception handling for audio processing operations and if it degrades gracefully when features are unsupported.0 points if no exception handling exists, 5 points if basic error handling is implemented but lacks comprehensive coverage, 10 points if robust error handling with user-friendly recovery mechanisms is provided throughout.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Beat detection for automatic loop suggestions 2. Audio effects library for loop processing 3. Loop library management system 4. Keyboard shortcuts for precise editing). Consider both technical innovation and user experience improvements.Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar audio processing functions 2. Function modules unrelated to audio loop editing (e.g., unnecessary social features) 3. Excessive visual effects that affect performance (e.g., complex animations that slow down the audio processing). Evaluate if the core functionality is obscured by unnecessary features.Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating audio processing logic/UI components/file management), appropriate use of design patterns for audio handling, and code organization. Check for proper handling of memory-intensive audio operations, browser performance considerations, and adherence to web audio best practices.Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if audio processing is inefficient or causes browser performance issues. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern audio tool design principles: 1) Intuitive waveform visualization with clear color contrast 2) Proper layout of controls with logical grouping of related functions 3) Professional typography system with adequate contrast for readability. Check if the interface resembles industry-standard audio editing tools in terms of usability.Deduct 3 points for each poorly designed UI element, 5 points for confusing audio visualization, and 5 points for unintuitive control placement. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the audio editing interactions conform to expected behavior: 1) Real-time audio playback response when adjusting parameters 2) Smooth waveform zooming and scrolling 3) Responsive selection markers with appropriate visual feedback. Check if there are any audio glitches during playback or processing operations.Deduct 5 points for any audio playback delays exceeding 200ms, 3 points for jerky waveform navigation, and 5 points for unresponsive selection tools. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Multimedia Editing-Audio Editing",
  "difficulty": "hard"
}