{
  "index": 573,
  "question": "You are a code expert, please use your professional knowledge to generate accurate and professional responses. Try to ensure that the generated code is executable for demonstration.\n\n======== Role ========\nYou are an experienced code expert. You are provided with a software development requirement description, and you need to generate project code based on these requirements. Strictly follow the rules to help users generate complete project code with simple and understandable commentary, without outputting anything else.\n\n======== Output Rules ========\n1. You should always generate complete, runnable project code. Please ensure the project is fully executable.\n2. Ensure that all code files you output are complete, without omitting any code.\n3. Carefully review and check all code before final output, evaluating its executability. If the code cannot be executed or contains errors, regenerate it.\n4. If the requirements involve external API access or need to use user data (images, videos, audio, etc.), please provide simulated data.\n\n======== Project Requirements ========\nWrite code to create an online video format conversion tool. After users upload videos, they can select the target video format (such as MP4, AVI, FLV, etc.) on the front-end page, click the convert button, and then convert the video to the specified format and provide a download link.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the video upload functionality properly implemented?",
      "description": "Review whether the code properly implements file upload using HTML/JavaScript with proper validation for video files. Check if it includes file type checking, size limitations, and progress indication during upload. Score 0 if there's no upload functionality, 5 if basic upload exists but lacks validation or progress indication, and 10 if the implementation is complete with all validations and user feedback.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the format conversion functionality implemented correctly?",
      "description": "Evaluate whether the code includes proper backend implementation for video format conversion using appropriate libraries (like FFmpeg). Check if all mentioned formats (MP4, AVI, FLV, etc.) are supported. Score 0 if conversion logic is missing, 5 if only basic conversion is implemented with limited formats, and 10 if comprehensive conversion with multiple format options and proper error handling is included.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the download functionality properly implemented?",
      "description": "Check if the code provides a secure download mechanism for the converted videos, including proper file naming, content-type headers, and download progress indication. Score 0 if download functionality is missing, 5 if basic download exists but lacks proper implementation details, and 10 if a complete and secure download system is implemented.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there a proper conversion status/progress tracking mechanism?",
      "description": "Evaluate whether the code includes real-time progress updates during conversion, estimated time remaining calculations, and proper status notifications. Score 0 if no progress tracking exists, 5 if basic status updates are provided but not real-time, and 10 if comprehensive real-time progress tracking with visual indicators is implemented.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as upload failures, conversion errors, invalid file types, server disconnections, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Video preview before conversion 2. Batch processing capabilities 3. Additional video editing options like trimming/cropping 4. Conversion presets for common devices). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple file handling methods) 2. Function modules unrelated to video conversion (e.g., unnecessary social sharing features) 3. Fancy effects that affect performance (e.g., excessive animations during conversion). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating upload/conversion/download logic), error handling, security measures (against injection attacks), and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance during the multistep conversion process. Deduct 5 points for each operation without feedback, 3 points for visual after-images during transitions, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Multimedia Editing-Video Production",
  "difficulty": "medium"
}