{
  "index": 1472,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you provide is executable. Help me write a mini program similar to the Xianyu platform, called \"Heavy Industry Second-hand Trading Platform,\" targeted for college students' use. It should be written in HTML and run in a browser. Please provide the complete code.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core marketplace functionality fully implemented?",
      "description": "Evaluate if the code implements essential e-commerce functions: product listing, search functionality, product detail pages, and category filtering. Score 0 if these core features are missing, 5 if only basic listing is implemented, and 10 if all marketplace functionalities work properly with appropriate data handling.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the user authentication and profile management implemented?",
      "description": "Check if the code includes complete user registration, login/logout functionality, and profile management (including editing personal information, viewing transaction history). Deduct 5 points if authentication is missing security measures (like password hashing), and 3 points if profile editing is incomplete. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the product listing and management system properly developed?",
      "description": "Assess whether users can post new items with images, descriptions, and pricing. Check if the system includes editing/deleting listings and proper validation for required fields. Deduct 5 points if image handling is not implemented, and 3 points if form validation is missing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the message/chat system for buyer-seller communication implemented?",
      "description": "Evaluate whether the platform includes a messaging system allowing potential buyers to communicate with sellers. Check if the system supports message history, notifications, and real-time updates. Deduct 5 points if there's no messaging functionality at all, 3 points if it's incomplete. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as form submission errors, image loading failures, network interruptions, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Real-time price tracking 2. Campus location-based filtering 3. Student verification system). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple listing creation forms) 2. Function modules unrelated to second-hand trading (e.g., a built-in game) 3. Fancy effects that affect performance (e.g., excessive animations). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating UI components, data models, and controllers), code reusability, and organization. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there's no clear project structure. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast scrolling, and 5 points if key functions (like 'post item' or 'contact seller') are difficult to find. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Online Shopping",
  "difficulty": "medium"
}