{
  "index": 1814,
  "question": "You are a coding expert. Please utilize your professional knowledge to generate accurate and professional responses. Ensure that the code you produce is executable for demonstration. Create a simple international trade product website with a carousel/slideshow banner.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the carousel/slideshow banner fully implemented?",
      "description": "Evaluate whether the carousel includes essential features: automatic sliding, manual navigation (prev/next buttons), indicator dots, responsive images, and smooth transitions. Score 0 if the carousel is not implemented, 5 if only basic sliding is included, and 10 if all features are properly implemented with optimized performance (preloading images, efficient animation).",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the international trade product showcase properly implemented?",
      "description": "Check if the product listing includes essential e-commerce elements: product images, names, prices, brief descriptions, and call-to-action buttons. Products should be organized by categories relevant to international trade (e.g., by country, industry, or certification). Deduct 3 points if products lack critical information, 3 points if categorization is poor, and 4 points if there's no filtering/sorting functionality. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Does the website include international trade specific features?",
      "description": "Review for industry-specific elements such as country of origin indicators, shipping/logistics information, trade terms (Incoterms), currency converters, or certification icons (e.g., CE, FDA). Deduct 5 points if completely missing these elements. Award full 10 points if the site includes at least 3 specialized international trade features implemented functionally.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the website responsive and cross-browser compatible?",
      "description": "Test whether the layout adapts properly to different screen sizes (mobile, tablet, desktop) and works correctly in major browsers (Chrome, Firefox, Safari). Check if media queries are implemented correctly and if the carousel maintains functionality across devices. Deduct 5 points for broken layouts on mobile, 3 points for browser-specific issues, and 2 points for missing viewport meta tag. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as missing images, slow network connections, user interaction errors, etc.) and provide friendly error handling or fallbacks. Code with strong robustness should include image error handling, graceful degradation, and form validation. Give 10 points for comprehensive error handling, 5 points for basic error handling, and 0 points if errors crash the functionality.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Interactive product comparison 2. Quick-view product modals 3. Animated statistics about trade volumes 4. Multi-language support). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple carousel libraries used together) 2. Function modules unrelated to international trade products (e.g., unrelated social media feeds) 3. Fancy effects that affect performance (e.g., excessive animations or 3D effects). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating HTML structure, CSS styling, and JavaScript behavior), code organization, and maintainability. Deduct 5 points if inline styles/scripts are heavily used; deduct 3 points if CSS selectors are inefficient or overly specific; deduct 2 points if JavaScript is not properly structured or contains global namespace pollution. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching suitable for international business (professional blues, neutral tones) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for cluttered layouts, 5 points for unprofessional color schemes, and 5 points for poor typography. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Carousel transitions smooth without janky movements 2) Hover/click states provide clear feedback within 100ms 3) Page loading optimized with proper indicators. Deduct 5 points for laggy transitions, 3 points for missing interactive feedback, and 5 points for carousel animations that are disorienting or too fast/slow. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Online Shopping",
  "difficulty": "easy"
}