{
  "index": 456,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable. Please help me create a website for selling products, with diverse functionality, minimalist design, and a strong tech-oriented feel.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the product listing and catalog system fully implemented?",
      "description": "Review whether the code implements a complete product catalog with filtering, sorting, and search functionality. Check if products have detailed pages with comprehensive information (images, descriptions, specifications, pricing). Score 0 if core product display is missing, 5 if basic listing is implemented without search/filter, and 10 if a complete catalog system with all features is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the shopping cart and checkout process properly implemented?",
      "description": "Evaluate the shopping cart functionality (add/remove items, quantity adjustment, price calculation) and checkout process (address input, shipping options, payment integration). Deduct 5 points if the cart doesn't persist between sessions, 3 points if price calculations have errors, and 3 points if the checkout flow is incomplete. A complete implementation with order confirmation emails gets full 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is user authentication and account management implemented?",
      "description": "Check if the implementation includes secure user registration, login/logout functionality, password recovery, and profile management. Verify that authentication uses modern security practices (password hashing, CSRF protection, session management). Deduct 5 points for missing password recovery, 5 points for insecure password storage, and 3 points for incomplete profile management. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the responsive design properly implemented across devices?",
      "description": "Assess whether the website is fully responsive across different screen sizes (mobile, tablet, desktop) using media queries and flexible layouts. Check if images are optimized for different resolutions and if the navigation adapts for mobile users. Deduct 5 points if the mobile experience is broken, 3 points if tablet view has layout issues, and 2 points if desktop optimizations are missing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as form validation errors, API failures, network interruptions, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Real-time product availability indicators 2. AR product visualization 3. AI-powered product recommendations 4. Dark mode toggle). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple cart implementations coexisting) 2. Function modules unrelated to e-commerce (e.g., a built-in game) 3. Fancy effects that affect performance (e.g., excessive animations slowing page load). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating data/view/controller layers), code organization, component reusability, and build process automation. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if the build process is not automated. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Online Shopping",
  "difficulty": "medium"
}