{
  "index": 583,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be sure to ensure that the generated code is executable for demonstration purposes. Develop an online shoe shopping frontend project with a homepage featuring a brand special sale display area showing participating brands and discount levels. The navigation bar includes a \"Size Assistant\" link that opens a modal dialog displaying conversion tables for different brand shoe sizes. The product listing page supports filtering shoes by gender. The product detail page features 360-degree rotation views of shoes and on-foot effect images. The shopping cart page supports combining identical items (if there are same style items in different sizes, they can be merged into one entry). The checkout page supports installment payment functions (simulating installment options and amount per installment).",
  "checklist": [
    {
      "id": 0,
      "title": "Is the homepage with brand special sale display area fully implemented?",
      "description": "Evaluate whether the homepage includes a professional brand special sale display section showing participating brands and their corresponding discount levels. Check for: 1) Clear visual hierarchy of brand logos, 2) Discount percentage indicators, 3) Responsive layout adaptation, 4) Smooth hover/click interactions. Give 10 points for a fully implemented, visually appealing solution with animations; 5 points if basic functionality exists but lacks visual polish; 0 points if the section is missing or non-functional.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the 'Size Assistant' modal dialog properly implemented?",
      "description": "Review the implementation of the Size Assistant modal dialog accessed from the navigation bar. Check whether it displays comprehensive conversion tables for different brand shoe sizes. Evaluate: 1) Modal opening/closing mechanics, 2) Table formatting and readability, 3) Cross-brand comparison capability, 4) Mobile responsiveness. Deduct 3 points if the modal isn't properly centered or has z-index issues, 3 points if the size information is incomplete, 4 points if the modal is not dismissible via multiple methods (close button, overlay click, ESC key). The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is product filtering by gender fully functional?",
      "description": "Assess whether the product listing page allows effective filtering of shoes by gender. Check for: 1) Clear gender selection UI (radio buttons/tabs/dropdown), 2) Immediate visual feedback when filter is applied, 3) Proper state management preserving selected filters during navigation, 4) URL parameter reflection of current filters. Deduct 5 points if filter state is lost during page refresh; 3 points if multiple filter combinations aren't supported; 2 points if there's no visual indication of active filters. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are the 360-degree rotation and on-foot effect features implemented?",
      "description": "Evaluate the product detail page's interactive features, specifically the 360-degree rotation view and on-foot effect images. Check: 1) Smooth rotation implementation using mouse drag/swipe gestures, 2) Preloading strategy for rotation images, 3) Multiple on-foot preview images from different angles, 4) Zoom functionality on both features. Score 10 points if both features are fully implemented with smooth performance; 5 points if only one feature works well or both have performance issues; 0 points if neither feature is functional.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as network failures during image loading, broken product image links, invalid filter combinations, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. AR shoe try-on, 2. Social sharing with customized cards, 3. Recently viewed product history with local storage). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple cart management systems) 2. Function modules unrelated to shoe shopping (e.g., unnecessary analytics tools) 3. Fancy effects that affect performance (e.g., excessive animations slowing page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating product/cart/checkout logic), component reusability, and code organization. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there's no separation of concerns between UI rendering and business logic. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern e-commerce design principles: 1) Harmonious color matching (no more than 3 primary colors) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance. Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast sliding, and 5 points for hard-to-find key function buttons like 'Add to Cart' or 'Checkout'. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Online Shopping",
  "difficulty": "hard"
}