{
  "index": 643,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable for demonstration purposes. Develop an e-commerce product management system where customers can browse product listings on the frontend, view product details (including product name, price, inventory, description), and add products to their shopping cart. Merchants (username: seller, password: seller123) can log into the backend to add, delete, and modify product information, as well as process orders.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the product listing and browsing functionality fully implemented?",
      "description": "Check if the product listing displays essential information (product images, names, prices) in a clean grid or list view. Verify filtering and sorting capabilities (by price, category, popularity). The interface should support pagination or infinite scroll for large catalogs. Score 0 if the listing is non-functional, 5 if basic listing exists without filtering, 10 if complete with all product details and advanced filtering options.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are product detail pages comprehensive and user-friendly?",
      "description": "Evaluate if product detail pages show complete information (high-resolution images with zoom capability, detailed description, price, inventory status, specifications, and customer reviews). Check for related/similar product suggestions. Score 0 if detail pages are missing, 5 if they only show basic information without images or with poor layout, 10 if comprehensive with intuitive navigation and rich media support.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the shopping cart functionality properly implemented?",
      "description": "Verify if users can add/remove items, adjust quantities, and see real-time price calculations. Cart should persist between sessions (using localStorage or user accounts), show inventory limitations, and provide clear checkout options. Score 0 if cart functionality is absent, 5 if basic add/remove works but lacks persistence or quantity management, 10 if fully functional with error handling for out-of-stock items.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the merchant backend management system complete?",
      "description": "Check if the seller interface includes secure login (username: seller, password: seller123), comprehensive product CRUD operations, batch operations for inventory, and order management capabilities. Verify image upload functionality and rich text editor for product descriptions. Score 0 if backend management is missing, 5 if basic functions work but lack data validation or have usability issues, 10 if complete with advanced features and security measures.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code handles common abnormal situations (invalid inputs, network failures, authentication errors) and provides friendly error messages. Verify form validation, secure authentication, and data persistence integrity. Score 0 if no error handling exists, 5 if basic validations are implemented but edge cases are ignored, 10 if comprehensive error handling with graceful recovery mechanisms exist throughout the application.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check for surprise features that enhance the experience (e.g., 1. AI-powered product recommendations 2. Real-time inventory alerts 3. Visual search capabilities 4. AR product previews). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple cart management systems) 2. Function modules unrelated to e-commerce (e.g., built-in games) 3. Fancy effects that affect performance (e.g., excessive animations that slow page loading). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (separation of concerns between product display, cart management, and admin functions), consistent coding patterns, component reusability, and proper data management. Deduct 5 points if global state is poorly managed; deduct 5 points if code duplication rate is high; deduct 5 points if the application lacks proper build/deployment configuration. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional e-commerce design standards?",
      "description": "Evaluate whether the design follows e-commerce best practices: 1) Clear product hierarchy and visual hierarchy 2) Consistent branding and color scheme (primary, secondary, accent colors) 3) Professional typography (readable product titles, descriptions) 4) Proper use of white space and grid layouts. Deduct 3 points for cluttered product displays, 5 points for inconsistent visual language across pages, and 5 points for poor mobile responsiveness. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the shopping experience feels natural: 1) Product filtering/sorting updates ≤ 300ms 2) Add-to-cart animations are subtle and satisfying 3) Clear loading states during data fetching 4) Form submissions provide immediate feedback. Deduct 5 points for laggy product browsing, 3 points for jarring page transitions, and 5 points for confusing checkout flow. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Web Applications-Online Shopping",
  "difficulty": "medium"
}