{
  "index": 12,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Try to ensure that the generated code is executable for demonstration.\nPlease use HTML and JavaScript to implement a \"Spirit Summoning\" game.\n**Task**: Allow players to summon spirits or pets to assist in battles or puzzle-solving. Spirits can have different abilities and behavior patterns.\n**Hint**: You can set up a summoning system and design unique skills or characteristics for each spirit to help players complete tasks. Please think through and answer in detail, striving to implement a solution that is as complete as possible, meets the requirements, has a good game interface, and high playability. Note: The functionality should be implemented using HTML that can be executed directly in the frontend.\nPlease include comments in your code to help other developers understand your implementation process.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core spirit summoning mechanic fully implemented?",
      "description": "Review whether the code accurately implements a spirit summoning system through HTML/JavaScript, including a clear summoning interface, selection mechanism, and successful/failed summoning feedback. Check if summoned spirits appear visually on screen with distinct appearances. Score 0 if summoning doesn't work, 5 if basic summoning exists but lacks variety, and 10 if there's a complete summoning system with multiple spirits and visual effects.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the spirits' unique abilities and behavior patterns well-designed?",
      "description": "Evaluate whether each spirit has distinct abilities (attack patterns, special skills, passive effects) and behavior patterns (movement, AI decision-making). Check if spirits react differently to game situations and player commands. Deduct 3 points if spirits are merely cosmetic with no functional differences, 5 points if abilities exist but lack strategic depth, and 7 points if behavior patterns are static/predictable. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there a meaningful battle or puzzle-solving system where spirits assist?",
      "description": "Assess whether the game includes challenges (battles or puzzles) where spirits provide meaningful assistance. Check if different spirits offer strategic advantages in different scenarios. Deduct 5 points if challenges are trivial or spirits' contributions are negligible, and 3 points if the system lacks strategic depth. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there a progression or enhancement system for spirits?",
      "description": "Check for implementation of growth mechanics such as leveling up spirits, unlocking new abilities, upgrading existing skills, or spirit evolution. Verify if player actions influence spirit development and if the system provides clear feedback on progression. Score 0 if no progression exists, 5 if basic progression with minimal impact on gameplay, and 10 if comprehensive progression with meaningful effects on gameplay.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid inputs, unexpected interactions, rapid clicking, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Dynamic spirit fusion system 2. Environmental interaction between spirits 3. Spirit personality system affecting behaviors). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple spirit selection methods that do the same thing) 2. Function modules unrelated to the core gameplay (e.g., unnecessary mini-games that distract from the main experience) 3. Fancy effects that affect performance (e.g., excessive particle effects causing lag). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating game logic/view/spirits behavior layers), code organization, quality of comments, and maintainability. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if comments are insufficient or misleading. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching (thematic colors appropriate for a mystical/spiritual game) 2) Proper layout spacing (element spacing follows the 8px multiple principle) 3) Professional font system (body font size ≥ 14px, line height over 1.5 times). Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Summoning feedback delay ≤ 100ms 2) Spirit animation transitions controlled between 300-500ms 3) Clear visual indication of spirit actions and abilities. Deduct 5 points for each operation without feedback, 3 points for choppy animations during spirit actions, and 5 points for unclear spirit status indicators. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Role-Playing",
  "difficulty": "medium"
}