{
  "index": 841,
  "question": "You are a coding expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you produce is executable and can be demonstrated. Create a Three Kingdoms role-playing game using HTML, featuring rich storylines and comprehensive gameplay mechanics.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the Three Kingdoms setting authentically implemented?",
      "description": "Check whether the code implements an immersive Three Kingdoms environment with historically accurate characters (e.g., Liu Bei, Guan Yu, Zhang Fei, Cao Cao, Sun Quan), events, and locations from the era. Score 0 if there are no authentic Three Kingdoms elements, 5 if only basic character references are included, and 10 if the game features rich historical context with accurate representation of major battles, alliances, and political dynamics.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the role-playing system comprehensively developed?",
      "description": "Evaluate whether the code implements core RPG mechanics including character attributes (strength, intelligence, leadership, etc.), skill trees specific to different Three Kingdoms heroes, equipment systems, and character progression. Deduct 5 points if character attributes don't influence gameplay, 3 points if skill acquisition is linear rather than branching, and 2 points if equipment has no meaningful impact on gameplay. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the storyline rich and engaging with multiple paths?",
      "description": "Check if the game offers branching storylines where player choices impact the narrative progression. Look for multiple story arcs (minimum 3 major storylines representing Wei, Shu, and Wu kingdoms), dialogue systems with meaningful choices, and consequences that alter the game world. Deduct 5 points if the story is completely linear, 3 points if choices don't meaningfully impact outcomes, and 2 points if historical events aren't incorporated into the narrative. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are the gameplay mechanics comprehensive and balanced?",
      "description": "Assess whether the game includes strategic battles, resource management, diplomacy systems, and character relationships. Each system should be interconnected and balanced. Examine if battle mechanics include terrain effects, unit types, and tactical options. Score 0 if core gameplay mechanics are missing, 5 if mechanics exist but lack depth or balance, and 10 if all systems are fully implemented with proper balancing and strategic depth.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid inputs, resource loading failures, browser compatibility issues, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Dynamic weather system affecting battles 2. Historical advisor system providing authentic context 3. Dynasty reputation mechanics influencing NPC interactions). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple inventory systems coexisting) 2. Function modules unrelated to the Three Kingdoms setting (e.g., anachronistic elements) 3. Fancy effects that affect performance (e.g., excessive particle effects during routine actions). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating game logic/view/data layers), code reusability for similar character abilities or battle mechanics, and asset management efficiency. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if assets aren't properly optimized for web performance. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the visual design authentically represents the Three Kingdoms era while following design principles: 1) Period-appropriate color palette and motifs 2) Consistent UI elements that don't break immersion 3) Proper typography that balances readability with thematic elements. Deduct 3 points for anachronistic visual elements, 5 points for inconsistent UI design, and 5 points for illegible text or overcrowded interfaces. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the game responds fluidly to player actions: 1) Battle animations that are visually distinct and provide clear feedback 2) Smooth transitions between game states (exploration, battle, dialogue) 3) Intuitive controls with appropriate visual and audio feedback. Deduct 5 points for laggy animations, 3 points for jarring transitions between game modes, and 5 points for unintuitive navigation that hinders gameplay. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Role-Playing",
  "difficulty": "medium"
}