{
  "index": 325,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure that the code you generate is executable. Could you create a similar dynamic website based on an existing one, and provide me with the source code? If you're confident you can do this, I'll share the website with you. How does that sound?",
  "checklist": [
    {
      "id": 0,
      "title": "Website Structure Implementation",
      "description": "Evaluate whether the code properly implements the basic structure of the website, including HTML markup, CSS styling, and JavaScript functionality that mirrors the reference site.Score 0 if the structure is completely different from the reference, 5 if it has similar structure but significant differences, and 10 if it accurately reproduces the reference site's structure with proper semantic HTML elements.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Visual Design Fidelity",
      "description": "Assess how closely the implementation matches the visual design of the reference site, including colors, typography, spacing, and overall layout.Deduct 2 points for each significant visual discrepancy from the reference site (colors off by more than 10% in RGB values, font sizes different by more than 2px, layout spacing off by more than 15px). The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Interactive Elements Functionality",
      "description": "Check whether all interactive elements (buttons, forms, dropdowns, etc.) function similarly to the reference site, including proper hover states, click events, and form validations.Deduct 2 points for each non-functional interactive element, and 1 point for each element with partial functionality (e.g., hover states work but click events don't). Give 10 points if all interactive elements work as expected.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Responsive Design Implementation",
      "description": "Evaluate whether the site is responsive like the reference site, adapting properly to different screen sizes (mobile, tablet, desktop) with appropriate breakpoints and media queries.Score 0 if no responsive design is implemented, 5 if basic responsiveness exists but with layout issues at certain breakpoints, and 10 if the implementation adjusts smoothly across all screen sizes matching the reference site's behavior.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as incorrect user input, network failures, resources failing to load, etc.) and provide friendly error prompts or recovery mechanisms.Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features or improvements over the reference site that enhance the experience (e.g., 1. Performance optimizations 2. Accessibility improvements 3. Enhanced animations or transitions).Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions 2. Function modules unrelated to the reference site 3. Fancy effects that affect performance and weren't in the original site.Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating components, styles, and logic), code organization, best practices for the technologies used, and build process implementation.Deduct 5 points if global style/script pollution is found; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if there's no separation of concerns. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern design principles: 1) Harmonious color matching 2) Proper layout spacing 3) Professional font system (body font size ≥ 14px, line height over 1.5 times).Deduct 3 points for each crowded visual element, 5 points for a glaring color combination, and 5 points for chaotic text-image layout. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the dynamic effects conform to human perception characteristics: 1) Click feedback delay ≤ 100ms 2) Transition animation duration controlled between 300-500ms 3) Clear visual focus guidance.Deduct 5 points for each operation without feedback, 3 points for visual after-images during fast interactions, and 5 points for hard-to-find key function buttons. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Other-Web Development",
  "difficulty": "hard"
}