{
  "index": 1276,
  "question": "You are a code expert. Please utilize your professional knowledge to generate accurate and professional responses. Be sure to provide executable code whenever possible. How can I make AI automatically write website code for me?",
  "checklist": [
    {
      "id": 0,
      "title": "Is there a clear explanation of AI code generation concepts and approaches?",
      "description": "Check whether the response explains the fundamental concepts of AI code generation, including different approaches (prompt engineering, model fine-tuning, using specialized AI coding assistants). Deduct 5 points if only a single approach is explained, 7 points if the explanation lacks technical depth. Full score: 10 points.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are practical tools and platforms for AI website code generation presented?",
      "description": "Evaluate the comprehensiveness of the AI code generation tool recommendations (e.g., GPT-4, GitHub Copilot, Amazon CodeWhisperer, Microsoft Power Pages). Deduct 3 points for each major platform category missing (code completion tools, no-code builders, specialized code generators). Give 10 points for a comprehensive list with pros/cons of each tool.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there a detailed walkthrough for using at least one AI code generation system?",
      "description": "Review whether the response provides step-by-step instructions for at least one AI code generation approach, including setup, prompt design, and output handling. Deduct 5 points if the instructions are too vague to follow, 3 points if they lack screenshots/examples. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Are there sample prompts or templates specifically designed for website code generation?",
      "description": "Check if the response includes effective prompt engineering techniques or templates specifically for website development tasks (e.g., layout creation, component design, API integration). Deduct 3 points for generic prompts without web-specific guidance, 5 points if fewer than 3 usable templates are provided. Full score: 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether any sample code provided handles common edge cases (responsive design, accessibility concerns, cross-browser compatibility, input validation, etc.) and follows best practices. Code with strong robustness should effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the response includes surprise features that enhance the AI code generation experience (e.g., 1. Version control integration 2. Automatic documentation generation 3. Performance optimization suggestions). Add 3 points for each practical innovative feature mentioned (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant explanation of similar AI tools 2. Unnecessary technical details unrelated to website generation 3. Overly complex approaches that complicate the process. Deduct 3 points for each redundancy found, and directly deduct 10 points if core information is obscured by redundant content.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the response have engineering quality?",
      "description": "Review whether the methodology suggested follows software engineering best practices (separation of concerns, modular design, testing strategies, iterative improvement). Deduct 5 points if the approach encourages monolithic code generation; deduct 5 points if no testing/validation strategy is mentioned; deduct 5 points if the process isn't iterative. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the guidance consider UI/UX design principles?",
      "description": "Evaluate whether the AI code generation approach incorporates modern design principles: 1) Responsive design 2) Accessibility standards 3) Visual hierarchy and user flow. Deduct 3 points for each design principle category neglected, 5 points if there's no mention of testing the generated UI with users, and 5 points if performance considerations are missing. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is there practical advice on limitations and human oversight?",
      "description": "Judge whether the response realistically addresses the limitations of AI code generation and provides guidance on necessary human oversight: 1) Security review needs 2) Performance optimization 3) Business logic validation. Deduct 5 points for overpromising AI capabilities, 3 points for not addressing technical debt concerns, and 5 points for failing to mention testing requirements. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Utility Tools-Automation",
  "difficulty": "easy"
}