{
  "index": 99,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the generated code is executable when possible.\n\nPlease use HTML and JavaScript to implement a Sports: Team Management and Season Mode\n\n**Task**: Implement a team management system where players can manage team rosters, training, and tactics, and participate in a complete season of matches.\n\n**Hint**: You can design a season progression system, and adjust team performance and player rankings based on match results.\n\nGame, and include some comments in the code so that other developers can understand your implementation process.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the team management system fully implemented?",
      "description": "Review whether the code accurately implements team roster management through HTML/JavaScript, including player recruitment, release, position assignment, and attribute management (skills, stamina, morale, etc.). Check if training systems are implemented with proper progression mechanics. Score 0 if core team management is missing, 5 if only basic roster operations exist, and 10 if comprehensive team management with training and player development is fully included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the season mode progression system implemented?",
      "description": "Check whether the season system includes complete match scheduling, league tables, playoff structures, and season calendar management. Evaluate if match simulation logic considers team tactics, player conditions, and realistic scoring mechanisms. Deduct 5 points if match results are purely random, and 3 points if season progression lacks proper pacing or milestone events. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the tactical system designed with strategic depth?",
      "description": "Evaluate whether the tactical system allows formation changes, strategy adjustments (offensive/defensive styles), and player role assignments that meaningfully impact match outcomes. Check if tactics interact with player attributes and opponent strategies. Deduct 5 points if tactics are cosmetic only, and 3 points if the system lacks tactical variety or counter-strategies. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the performance tracking and ranking system constructed?",
      "description": "Check whether the code includes comprehensive statistics tracking for both teams and individual players, dynamic ranking systems that update based on performance, and historical data preservation across seasons. Evaluate if performance metrics influence player values, team reputation, and future opportunities. Deduct 5 points if statistics are not persistent, and 3 points if ranking algorithms are overly simplistic. Give 10 points if fully implemented with detailed analytics.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid player transfers, corrupted save data, simulation errors, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. AI-powered scouting recommendations 2. Dynamic weather effects on matches 3. Social media simulation for team popularity 4. Injury recovery mini-games). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple save/load systems coexisting) 2. Function modules unrelated to sports management (e.g., built-in social media feed) 3. Fancy effects that affect performance (e.g., complex 3D stadium renders). Deduct 3 points for each redundancy found, and directly deduct 10 points if core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating game logic/UI/data management layers), code documentation quality, and maintainable architecture patterns. Deduct 5 points if global state pollution is found or proper encapsulation is missing; deduct 5 points if the code lacks sufficient comments or has poor naming conventions; deduct 3 points if data structures are inefficient. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the overall design follows modern sports management UI principles: 1) Consistent color scheme reflecting team branding 2) Dashboard layout with clear information hierarchy 3) Professional typography with readable statistics tables. Deduct 3 points for each cluttered interface section, 5 points for poor color contrast in data visualization, and 5 points for inconsistent spacing or alignment. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the interactive elements provide appropriate feedback: 1) Drag-and-drop for player transfers with visual confirmation 2) Smooth transitions between different management screens 3) Real-time updates during match simulations with proper pacing. Deduct 5 points for each unresponsive interaction, 3 points for jarring transitions between screens, and 5 points for poorly paced match simulation that feels rushed or tedious. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Sports",
  "difficulty": "medium"
}