{
  "index": 1462,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Make sure the code you generate is executable whenever possible. Help me create a web-based version of Plants vs. Zombies: Naruto Edition.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the core game mechanics properly implemented?",
      "description": "Evaluate whether the code accurately implements the basic Plants vs. Zombies gameplay mechanics with Naruto theme: plant placement, zombie movement, collision detection, sun resource collection, and wave management. Score 0 if core mechanics are missing, 5 if basic functionality exists but lacks refinement, and 10 if all mechanics are properly implemented with appropriate Naruto character adaptations.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Are the Naruto-themed characters and abilities properly integrated?",
      "description": "Check whether the code includes Naruto universe characters as both plants (defenders) and zombies (attackers) with appropriate abilities reflecting their canonical powers. Each character should have unique animations, attack patterns, and special abilities that align with their representation in the Naruto series. Deduct 3 points if characters are merely reskins without unique abilities, 5 points if abilities don't match Naruto lore. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the level progression and difficulty scaling implemented?",
      "description": "Assess whether the game includes progressive difficulty through multiple levels with increasing challenges. Check for implementation of different terrains (forests, villages, etc. from Naruto universe), day/night cycles affecting gameplay, and special events like boss battles. Deduct 5 points if difficulty doesn't scale properly, 3 points if level variety is minimal. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the chakra/energy resource system properly implemented?",
      "description": "Evaluate the implementation of a resource system equivalent to the sun collection in the original game, but themed around chakra or energy in the Naruto universe. Check whether the code includes methods for generating resources, storing them, and using them to deploy defenders. There should be visual feedback and appropriate animations. Deduct 5 points if the resource economy is unbalanced, 3 points if visual feedback is inadequate. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as rapid clicking, browser resizing, invalid plant placements, etc.) and provide friendly error handling or recovery mechanisms. Code with strong robustness should be able to effectively handle edge cases like interrupted animations or memory leaks, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Jutsu combo system 2. Character evolution based on combat performance 3. Multiplayer mode where one player controls zombies 4. Interactive cutscenes featuring Naruto storylines). Add 2.5 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar characters (e.g., multiple characters with identical abilities but different sprites) 2. Function modules unrelated to the core gameplay (e.g., unnecessary mini-games) 3. Excessive visual effects that affect performance (e.g., particle systems that cause lag). Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review the modular design (separation of game logic, rendering, asset management), maintainability (appropriate comments, consistent naming conventions), and optimization (efficient collision detection, sprite batching, asset preloading). Deduct 5 points if global state pollution is found or if design patterns are not used; deduct 3 points if code duplication rate is high; deduct 2 points if there's no performance optimization for mobile devices. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the interface vision meet professional design standards?",
      "description": "Evaluate whether the game UI follows both the original Plants vs. Zombies layout style and integrates Naruto visual elements appropriately: 1) Thematic color palette matching Naruto's world 2) Clean and intuitive grid system for plant placement 3) Clear indicators for resources, waves, and special abilities 4) Proper integration of Naruto iconography and symbols. Deduct 3 points for inconsistent visual style, 4 points for cluttered UI elements, and 3 points for poor readability. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the dynamic interaction smooth and seamless?",
      "description": "Judge whether the game animations and interactions feel responsive and satisfying: 1) Plant selection and placement feels immediate (≤ 100ms response) 2) Attack animations are fluid and impactful 3) Zombie defeat animations provide satisfying feedback 4) Special jutsu effects are visually distinctive without obstructing gameplay. Deduct 3 points for sluggish controls, 4 points for choppy animations during intense moments, and 3 points for confusing visual feedback. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Strategy",
  "difficulty": "hard"
}