{
  "index": 210,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate and professional responses. Be careful to ensure that the generated code is executable and displayable. You are a master of device management. Can you help me build a device lifecycle management system for fine chemical enterprises, aimed at equipment management personnel, the three engineers (mechanical, electrical, and instrument engineers), and equipment users? It's for daily equipment work management, for designated personnel use. Please help me design it with a navy blue and white color scheme as the main color palette. Output in HTML format.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the device lifecycle management core functionality fully implemented?",
      "description": "Review whether the code accurately implements comprehensive device lifecycle stages through HTML/JavaScript, including device registration, maintenance scheduling, status monitoring, retirement planning, and asset tracking. Check if it covers all phases from procurement to disposal with proper state transitions. Score 0 if core lifecycle logic is not implemented, 5 if only basic CRUD operations are present, and 10 if complete lifecycle management with automated workflows is included.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the multi-role user management system properly implemented?",
      "description": "Evaluate whether the system includes role-based access control for equipment management personnel, mechanical/electrical/instrument engineers, and equipment users. Check for proper permission segregation, role-specific dashboards, and secure authentication mechanisms. Verify that each role has appropriate access levels and functionality tailored to their responsibilities. Deduct 5 points if role separation is unclear, 3 points if permission validation is missing. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is the equipment work management and scheduling system comprehensive?",
      "description": "Check whether the code implements daily work management features including maintenance schedules, work order creation/assignment, equipment downtime tracking, and performance analytics. Evaluate if preventive maintenance, corrective maintenance, and emergency response workflows are properly designed. Deduct 5 points if scheduling algorithms are basic, 3 points if notification systems are missing. Full score requires advanced scheduling with conflict resolution.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is the fine chemical industry compliance and safety framework integrated?",
      "description": "Review whether the system addresses fine chemical industry-specific requirements such as hazardous equipment classification, safety protocol enforcement, regulatory compliance tracking, and incident reporting mechanisms. Check for integration of safety checklists, permit-to-work systems, and environmental monitoring. Deduct 5 points if industry-specific features are generic, 3 points if safety protocols are not enforced. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as invalid device data input, network interruption, concurrent user operations, data corruption, etc.) and provide friendly error prompts or recovery mechanisms. Code with strong robustness should effectively handle edge cases including database failures, API timeouts, and user permission changes. Give 10 points if fully robust, 5 points if average robustness, and 0 points if no exception handling.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there innovative features that enhance enterprise workflow?",
      "description": "Check whether the code includes valuable features that improve operational efficiency (e.g., 1. Predictive maintenance using equipment sensor data 2. Mobile-responsive interface for field technicians 3. Integration with ERP/CMMS systems 4. AI-powered equipment failure prediction 5. QR code-based equipment identification). Add 2-3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant implementation of similar functions (e.g., multiple equipment search mechanisms) 2. Function modules unrelated to device management (e.g., built-in games or social features) 3. Excessive animations that impact enterprise software performance. Deduct 3 points for each redundancy found, and directly deduct 10 points if core device management functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have enterprise-grade engineering quality?",
      "description": "Review modular design (separating data layer/business logic/presentation layers), security implementation, database design normalization, and scalability considerations. Deduct 5 points if sensitive data is not properly secured or SQL injection vulnerabilities exist; deduct 5 points if the code structure doesn't support enterprise scalability; deduct 5 points if no data backup/recovery mechanisms are implemented. Full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the navy blue and white interface design meet professional enterprise standards?",
      "description": "Evaluate whether the navy blue and white color scheme is professionally implemented following enterprise design principles: 1) Proper navy blue variants used consistently (#1e3a5f, #2c5282, etc.) 2) High contrast ratios for accessibility (minimum 4.5:1) 3) Professional typography with clear hierarchy 4) Clean white space utilization. Deduct 3 points for inconsistent color usage, 5 points for poor contrast affecting readability, and 5 points for unprofessional appearance unsuitable for industrial environments.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the enterprise user experience optimized for daily operations?",
      "description": "Judge whether the interface is optimized for daily enterprise use: 1) Quick access to frequently used functions 2) Efficient data entry forms with validation 3) Clear navigation suitable for different user roles 4) Responsive design for various devices used in industrial settings. Deduct 5 points for each workflow that requires excessive clicks, 3 points for forms lacking proper validation, and 5 points for navigation that doesn't clearly separate role-based functions. Full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Management Systems-Hardware Management",
  "difficulty": "hard"
}