{
  "index": 1229,
  "question": "You are a code expert. Please use your professional knowledge to generate accurate, professional responses. Be sure to provide executable code for demonstration. I'd like to see you create dancing pixel ponies with code.",
  "checklist": [
    {
      "id": 0,
      "title": "Is the dancing pixel pony animation fully implemented?",
      "description": "Check if the code creates a complete pixel pony character with proper sprite sheet or pixel-by-pixel rendering. The pony should have a distinct outline and recognizable pony features (head, body, legs, tail). Deduct 5 points if the pony shape is unclear, 3 points if proportions are significantly off. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 1,
      "title": "Is the dancing animation sequence implemented with smooth transitions?",
      "description": "Evaluate the animation loop that creates the dancing effect. Look for frame-by-frame animation or procedural movement that creates a natural dancing motion (leg movements, body bobbing, etc.). Animations should run at minimum 12fps for smoothness. Score 10 for fluid, natural movement; 5 for basic animation with some jerkiness; 0 if the pony is static or barely moves.",
      "maxScore": 10
    },
    {
      "id": 2,
      "title": "Is there variety in the dance movements or multiple dance patterns?",
      "description": "Check whether the code implements multiple dance patterns, transitions between dance moves, or randomized movement variations. Award 10 points for 3+ distinct dance patterns with smooth transitions; 5 points for 1-2 patterns; 0 points if only one repetitive movement exists.",
      "maxScore": 10
    },
    {
      "id": 3,
      "title": "Is there an interactive element allowing user control or influence?",
      "description": "Assess if the implementation includes user interaction to control the dancing ponies (e.g., mouse/keyboard input to change dance styles, speed, colors, or trigger special moves). Give 10 points for comprehensive interaction; 5 points for basic controls; 0 points for no interaction.",
      "maxScore": 10
    },
    {
      "id": 4,
      "title": "Is the code robust?",
      "description": "Evaluate whether the code can handle common abnormal situations (such as browser resizing, performance optimization for different devices, error handling for missing resources). Code with strong robustness should be able to effectively handle these edge cases, giving 10 points. If the robustness is average, give 5 points, and if no exceptions are handled, give 0 points.",
      "maxScore": 10
    },
    {
      "id": 5,
      "title": "Are there any innovative features that are eye-catching?",
      "description": "Check whether the code includes surprise features that enhance the experience (e.g., 1. Music synchronization with dance moves 2. Customizable pony colors/accessories 3. Particle effects or environmental elements like disco lights). Add 3 points for each practical innovative feature implemented (maximum 10 points).",
      "maxScore": 10
    },
    {
      "id": 6,
      "title": "Are there any redundant features?",
      "description": "Strictly check three types of redundancy: 1. Redundant animation loops or overlapping timers 2. Function modules unrelated to the dancing ponies 3. Excessive visual effects that cause performance issues. Deduct 3 points for each redundancy found, and directly deduct 10 points if the core functions are interfered with by redundant code.",
      "maxScore": 10
    },
    {
      "id": 7,
      "title": "Does the code have engineering quality?",
      "description": "Review modular design (such as separating animation logic/rendering/user input handling), performance optimization techniques (e.g., requestAnimationFrame usage, canvas vs. DOM manipulation choices), and code organization. Deduct 5 points if global state pollution is found or design patterns are not used; deduct 5 points if the code duplication rate is too high (over 30%); deduct 5 points if performance considerations are absent. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 8,
      "title": "Does the visual implementation meet professional design standards?",
      "description": "Evaluate whether the pony design shows artistic quality: 1) Consistent pixel art style with appropriate resolution 2) Harmonious color palette (no more than 3-4 primary colors unless intentionally colorful) 3) Proper use of animation principles like squash, stretch, anticipation. Deduct 3 points for inconsistent pixel sizing, 5 points for visually jarring color combinations, and 5 points for anatomically impossible animations unless stylistically justified. The full score is 10 points.",
      "maxScore": 10
    },
    {
      "id": 9,
      "title": "Is the rendering performance optimized and cross-browser compatible?",
      "description": "Judge whether the implementation is efficient and widely compatible: 1) Maintains 60fps on modern devices 2) Uses appropriate rendering technology (Canvas/WebGL for complex animations, SVG/CSS for simpler ones) 3) Implements fallbacks for different browsers. Deduct 5 points for each noticeable frame drop during animation, 3 points for missing browser compatibility considerations, and 5 points if the animation significantly taxes CPU/GPU on standard devices. The full score is 10 points.",
      "maxScore": 10
    }
  ],
  "class": "Game Development-Action/Rhythm",
  "difficulty": "hard"
}